readme.org
#+TITLE: Luca's literate Emacs config
#+STARTUP: content
#+OPTIONS: auto-id:t
#+OPTIONS: broken-links:t
#+OPTIONS: tags:nil
#+HTML_HEAD: <script>var clicky_site_ids = clicky_site_ids || []; clicky_site_ids.push(101260027);</script>
#+HTML_HEAD: <script async src="//static.getclicky.com/js"></script>

* Introduction
:PROPERTIES:
:CUSTOM_ID: h:49282F28-9E13-48D2-A565-1605B1CC57B8
:END:
** This file
:PROPERTIES:
:CUSTOM_ID: h:D9ED3ADB-810A-4A1C-A1D3-5397874AFAC7
:END:
This file (~readme.org~) is my literate emacs configuration. 
Every time I save the file, the code blocks get tangled.
By default, they get tangled (in sequence) to ~./init.el~.
Some blocks override this default (e.g. see the section [[*early-init.el][early-init.el]]).

This file also is exported to HTML, it can be viewed [[https://luca.cambiaghi.me/vanilla-emacs/readme.html][here]].
See [[*org-html-themify][this section]] for my configuration.
You can access my blog at the same [[https://luca.cambiaghi.me][website]].

** Why vanilla?
:PROPERTIES:
:CUSTOM_ID: h:40A8BDAE-F8E3-4DB3-AC8C-7E5067B7EE4D
:END:
I used [[https://github.com/hlissner/doom-emacs][DOOM emacs]] for an year and I was an happy user.
One day I woke up with the wish to understand Emacs a little more.

After about a week (12/01/2021) I had restored my configuration and in the process I understood better concepts such as:
- hooks
- minor and major modes
- advices
  
It is still a long journey but I am glad I started it.
** Why literate?
:PROPERTIES:
:CUSTOM_ID: h:B5231F9E-07D2-4738-97FD-78EC648B3F3D
:END:
Having your configuration in ~org-mode~ has some benefits and some drawbacks.
It adds a layer of abstraction between me and my ~init.el~ file, is it worth it?

The main drawback is that it can happen that the ~org-mode~ file has a mistake and tangles
an incorrect ~init.el~ file. In that case you can't use your nice bindings but you are
thrown in barebones emacs and you have to =C-x C-f= your way to the ~init.el~ and run
~check-parens~.

Another drawback is that a big configuration can be slow to tangle and tangling on save can block ~emacs~.
See [[#h:16B948EA-5375-44DE-ACD7-3664D4A9CE5F][this section]] for a solution to this drawback.

Let's consider some of the benefits:
- I can export this file to HTML ([[https://luca.cambiaghi.me/vanilla-emacs/readme.html][here]])
- People can read this file on Github ([[https://github.com/lccambiaghi/vanilla-emacs][here]]) 
- I can comfortably document my configuration (and not from within comments), include links, ~sh~ code blocks, etc.
- I can organize my configuration blocks in sections, easily disable some headings with ~COMMENT~
** Modules
:PROPERTIES:
:CUSTOM_ID: h:C522D670-C206-44F7-96CE-17D01E578287
:END:
I tangle this file with the function ~lc/tangle-config~, you can read source code in [[#h:16B948EA-5375-44DE-ACD7-3664D4A9CE5F][this]] section.
Every time I save this ~.org~ file, it is tangled to multiple ~.el~ files.

I achieve that by means of this file's "local variables", which I put at the end of the ~.org~ file:
#+begin_src org
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(progn (lc/org-add-ids-to-headlines-in-file) (lc/tangle-config))) nil t)
# End:
#+end_src

To design modules, I look at blocks in my config that I would like to toggle on and off.
For example if I am on an iPad I may want to not load anything related to Python or ~vterm~.

I assign org properties to each heading. These are determine which ~.el~ file they will be britten to.
For example the header of the section concerning ~lsp-mode~ has the following properties:
#+begin_src org
:PROPERTIES:
:CUSTOM_ID: h:6BC08822-D2B3-4BE9-9EBE-C42F89F0E688
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-lsp.el
:END:
#+end_src

All subheadings under it will "inherit" those properties and will be tangled to the same file.
We also need to write some ~emacs-lisp~ at the end of the tanged file to "provide" those modules.
[[#h:E80DEB4B-6AC9-415D-AF36-0044479D1B5A][Here]] an example of one of these "footer" headers.

I then have a lean ~init.el~ (written in [[#h:7B22A4F3-49A1-4848-A185-B4EEA060EECE][this]] section) which I use to control which modules I want to use in my session.
On my main computer I typically want to enable all of them.

** How can I fork it?
:PROPERTIES:
:CUSTOM_ID: h:A4F99DF1-6997-41C6-92B2-2226913F0C21
:END:
I guess one could fork this repo and use this ~org~ file as template.
You can duplicate this file, give it another name and tangle that file to your ~init.el~.

I would start with a "small" configuration, just with the "core" functionalities.
For example the [[#h:EC68944C-F745-45D8-9905-420E0813DBAF][Startup]], the [[#h:376622D2-A6B7-4050-97C6-413B0D77B89C][Package manager]] and [[#h:403F77CB-A591-4431-B568-CD802876F770][general]] sections would be a good starting point.

Then, you can start importing "sections" you are curious about, for example [[#h:06E0EA9F-7CF4-4B99-8A4A-2C63A4F8A6B6][Completion framework]] .
You could also ~COMMENT~ all headings and uncomment only those which are interesting to you.
You could find the ~org-toggle-comment~ command useful, after selecting all headings in the file.

** Structure of this configuration
:PROPERTIES:
:CUSTOM_ID: h:CEDB99C8-27AD-4118-8C8D-29A5882E47AE
:END:
- In the second section some optimization of startup time, mostly stolen from smart people.
- In the third section we bootstrap ~straight~ and  ~use-package~, our package managers
- In the fourth section we configure ~emacs~ with sane defaults and extend some its core features (e.g. ~help-mode~)
- In the fifth section we set up ~general~, which we use to manage our keybindings and lazy loading of packages. Afterwards we configure ~evil~, for modal editing.
- In the sixth section the invaluable ~org-mode~ with several extensions
- The remaining sections declare my personal configuration of UI and core packages, leveraging the great tools described in this list.
** Notable sections
:PROPERTIES:
:CUSTOM_ID: h:5752563C-7D7B-4AC2-866D-F0887C7B80AE
:END:
I am particularly proud of some sections in this configuration, because of one or more of these reasons:
- They improve my productivity considerably
- They are non-standard solutions (or at least hard to find online)
- They are particularly fine-tuned to my workflow

Here they are, without any ranking:
- [[*general][general]]
- [[#h:DC4B461C-91FC-4543-8C9C-FDF28121DCBA][eval operator]] 
- [[*evil-indent-plus][evil-indent-plus]]
- [[*evil-iedit-state][evil-iedit-state]]
- [[#h:B26642F5-695F-4475-92B5-2EB9B1C1A96A][evil-mc]]
- [[*org mode][org mode]]
- [[*ob-jupyter][ob-jupyter]]
- [[*org-tree-slide][org-tree-slide]]
- [[*evil-org-mode][evil-org-mode]]
- [[#h:AC175A47-E576-4AA6-A9C7-709129F4C56F][use org-id in links]] 
- [[*org-html-themify][org-html-themify]]
- [[#h:DE534B1B-9DF0-4966-A21C-B65B76B6A64E][org-jupyter-mode]] 
- [[#h:5F1EC880-5646-4E50-A460-C2F23BD864FC][Modus themes]] 
- [[*dashboard][dashboard]]
- [[*popup management][popup management]]
- [[*projectile][projectile]]
- [[#h:DADD41F3-F805-4E89-9EDB-B21350A81A19][hydra-smerge]]
- [[*envrc][envrc]]
- [[*yasnippet][yasnippet]]
- [[*dired][dired]]
- [[*web browser][web browser]]
- [[#h:28CB5546-FBE4-481D-B620-623006DC0FDA][lsp mode]]
- [[*dap-mode][dap-mode]]
- [[*pytest][pytest]]
- [[*jupyter][jupyter]]
- [[*evil-lisp state][evil-lisp state]] 
- [[#h:884FB8DF-D672-496E-9068-1FD15F0250E5][Adjust window size (transient)]]
* early-init.el and init.el
:PROPERTIES:
:CUSTOM_ID: h:EC68944C-F745-45D8-9905-420E0813DBAF
:END:
** early-init.el
:PROPERTIES:
:CUSTOM_ID: h:7DBC58C1-3944-437C-87F9-95C9202BD34E
:END:
Taken from DOOM's early init
#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;; early-init.el --- Early Init File -*- lexical-binding: t; no-byte-compile: t -*-
;; NOTE: early-init.el is now generated from readme.org.  Please edit that file instead

;; Defer garbage collection further back in the startup process
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)

;; In Emacs 27+, package initialization occurs before `user-init-file' is
;; loaded, but after `early-init-file'. Doom handles package initialization, so
;; we must prevent Emacs from doing it early!
(setq package-enable-at-startup nil)
;; Do not allow loading from the package cache (same reason).
(setq package-quickstart nil)

;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

;; Resizing the Emacs frame can be a terribly expensive part of changing the
;; font. By inhibiting this, we easily halve startup times with fonts that are
;; larger than the system default.
(setq frame-inhibit-implied-resize t)

;; Disable GUI elements
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-splash-screen t)
(setq use-file-dialog nil)

;; Prevent unwanted runtime builds in gccemacs (native-comp); packages are
;; compiled ahead-of-time when they are installed and site files are compiled
;; when gccemacs is installed.
(setq comp-deferred-compilation nil)

;;; early-init.el ends here
#+END_SRC

** init.el: startup optimization
:PROPERTIES:
:CUSTOM_ID: h:E6162DC2-7E1C-4843-8448-FF104A444B40
:END:
Taken from DOOM's init
#+BEGIN_SRC emacs-lisp :tangle init.el
;;; init.el --- Personal configuration file -*- lexical-binding: t; no-byte-compile: t; -*-
;; NOTE: init.el is now generated from readme.org.  Please edit that file instead

;; `file-name-handler-alist' is consulted on every `require', `load' and various
;; path/io functions. You get a minor speed up by nooping this. However, this
;; may cause problems on builds of Emacs where its site lisp files aren't
;; byte-compiled and we're forced to load the *.el.gz files (e.g. on Alpine)
(unless (daemonp)
  (defvar doom--initial-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  ;; Restore `file-name-handler-alist' later, because it is needed for handling
  ;; encrypted or compressed files, among other things.
  (defun doom-reset-file-handler-alist-h ()
    ;; Re-add rather than `setq', because changes to `file-name-handler-alist'
    ;; since startup ought to be preserved.
    (dolist (handler file-name-handler-alist)
      (add-to-list 'doom--initial-file-name-handler-alist handler))
    (setq file-name-handler-alist doom--initial-file-name-handler-alist))
  (add-hook 'emacs-startup-hook #'doom-reset-file-handler-alist-h)
  (add-hook 'after-init-hook '(lambda ()
                                 ;; restore after startup
                                 (setq gc-cons-threshold 16777216
                                       gc-cons-percentage 0.1)))
  )
;; Ensure Doom is running out of this file's directory
(setq user-emacs-directory (file-truename (file-name-directory load-file-name)))
#+END_SRC

** init.el: load modules
:PROPERTIES:
:CUSTOM_ID: h:7B22A4F3-49A1-4848-A185-B4EEA060EECE
:END:
#+begin_src emacs-lisp :tangle init.el
;; (add-to-list 'load-path "~/.emacs.d/lisp/")
(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

(let ((file-name-handler-alist nil)
      (gc-cons-threshold 100000000))
  (require 'init-core)
  (require 'init-ui-extra)
  (require 'init-org-roam)
  (require 'init-org-export)
  (require 'init-prog-vterm)
  (require 'init-prog-nix)
  (require 'init-prog-lsp)
  (require 'init-prog-python)
  (require 'init-prog-jupyter)
  (require 'init-prog-elisp)
  (require 'init-prog-markdown)
  ;; (require 'init-prog-r)
  ;; (require 'init-prog-clojure)
  (require 'init-prog-tree-sitter)
  (require 'init-extra-focus)
  (require 'init-extra-web)
  ;; (require 'init-extra-rss)
  ;; (require 'init-extra)
  )

;;; init.el ends here
#+end_src

* Package manager
:PROPERTIES:
:CUSTOM_ID: h:376622D2-A6B7-4050-97C6-413B0D77B89C
:header-args:    :emacs-lisp :tangle ./lisp/init-core.el
:END:
