readme.org
** bootstrap straight and straight-use-package
:PROPERTIES:
:CUSTOM_ID: h:686F7A63-013E-48ED-AC56-DF39BD398E20
:END:
Some rules/conventions:
- Prefer ~:init~ to ~:custom~. Prefer multiple ~setq~ expressions to one.
- Default to ~:defer t~, use ~:demand~ to force loading
- When packages do not require installation e.g. ~dired~, we need ~:straight (:type built-in)~ 
- If you specify ~:commands~, they will be autoloaded and the package will be loaded when the commands are first executed
    + If you use ~:general~ and bind commands to keys it will automatically load the package on first invokation

NOTE: if you change a package recipe from ~melpa~ to ~github~ in a ~use-package~ block but
that package is used as a dependency is used in a previous ~use-package~ block with a ~melpa~
recipe, you will get a warning. Just make sure to declare the "base" package with the ~github~ recipe first.

#+BEGIN_SRC emacs-lisp
(setq straight-use-package-by-default t)
(setq straight-vc-git-default-clone-depth 1)
(setq straight-recipes-gnu-elpa-use-mirror t)
;; (setq straight-check-for-modifications '(check-on-save find-when-checking))
(setq straight-check-for-modifications nil)
(setq use-package-always-defer t)
(defvar bootstrap-version)
(let* ((straight-repo-dir
        (expand-file-name "straight/repos" user-emacs-directory))
       (bootstrap-file
        (concat straight-repo-dir "/straight.el/bootstrap.el"))
       (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (shell-command
     (concat
      "mkdir -p " straight-repo-dir " && "
      "git -C " straight-repo-dir " clone "
      "https://github.com/raxod502/straight.el.git && "
      "git -C " straight-repo-dir " checkout 2d407bc")))
  (load bootstrap-file nil 'nomessage))
(straight-use-package 'use-package)
;; This is a variable that has been renamed but straight still refers when
;; doing :sraight (:no-native-compile t)
(setq comp-deferred-compilation-black-list nil)
#+END_SRC

** straight lockfile
:PROPERTIES:
:CUSTOM_ID: h:D0E05B42-6CEF-45A0-ACF9-E5F14F6DFE76
:END:
We can run ~M-x straight-freeze-versions~ to write the file ~straight/versions/default.el~.
The content of the file can then be kept in a code block, under version control.
The code block can then be tangle again to ~straight/versions/default.el~.
We can then restore package versions using ~M-x straight-thaw-versions~.

#+begin_src emacs-lisp :tangle no
(("Emacs-wgrep" . "f9687c28bbc2e84f87a479b6ce04407bb97cfb23")
 ("ace-window" . "0577c426a9833ab107bab46c60d1885c611b2fb9")
 ("all-the-icons-dired" . "5e9b097f9950cc9f86de922b07903a4e5fefc733")
 ("all-the-icons.el" . "6d48bc9e970ab559bc35a125c55fd83732595706")
 ("annalist.el" . "134fa3f0fb91a636a1c005c483516d4b64905a6d")
 ("avy" . "ba5f035be33693d1a136a5cbeedb24327f551a92")
 ("blacken" . "880cf502198753643a3e2ccd4131ee6973be2e8a")
 ("bui.el" . "f3a137628e112a91910fd33c0cff0948fa58d470")
 ("centaur-tabs" . "5860a5c40c2318797f1274ea4c6907ae77ea1ec9")
 ("centered-cursor-mode.el" . "4093821cc9759ca5a3c6e527d4cc915fc3a5ad74")
 ("cfrs" . "c1f639d7bfd3e728cf85dbe224b06a4be76158f4")
 ("consult" . "0940ca016531f3412003c231b476e5023a510ff9")
 ("corfu" . "2f5e15add5e1fdd20ff83d647e460cd8f85327a5")
 ("csv-mode" . "a4ad2e59d4039bf3b1bdbebdfab21c122ad5b487")
 ("dap-mode" . "76cad34de8984f57c2b1e374e9c985cc7ec8dad0")
 ("darkroom" . "27b928a6e91c3207742180f7e209bae754c9c1fe")
 ("dash.el" . "da167c51e9fd167a48d06c7c0ee8e3ac7abd9718")
 ("diff-hl" . "6fa3af0843093f44e028584a93eef091ec7e79d2")
 ("dired-hacks" . "7c0ef09d57a80068a11edc74c3568e5ead5cc15a")
 ("dired-hide-dotfiles" . "6a379f23f64045f5950d229254ce6f32dbbf5364")
 ("dired-single" . "b254f9b7bfc96a5eab5760a56811f2872d2c590a")
 ("docker-tramp.el" . "7bfbb55417e7d2aac53adf92cb0e3fd329c495c1")
 ("doom-modeline" . "5f30d231176186cbe5206aa133f91cea967717d9")
 ("el-get" . "9353309744e4f8a7c9b1adf22ec99536fb2146b0")
 ("eldoc" . "37e51a5810c496356cdb7107d14c2b7eb2dbdf0b")
 ("elisp-refs" . "c06aec4486c034d0d4efae98cb7054749f9cc0ec")
 ("elisp-tree-sitter" . "48b06796a3b2e76ce004972d929de38146eafaa0")
 ("emacs-async" . "0d52411d3accc3e11a2c64838703a8ce9755c77c")
 ("emacs-bind-map" . "bf4181e3a41463684adfffc6c5c305b30480e30f")
 ("emacs-dashboard" . "1bb5c43b6be65f72c2ff3ab948697c902458a32f")
 ("emacs-hide-mode-line" . "bc5d293576c5e08c29e694078b96a5ed85631942")
 ("emacs-libvterm" . "a940dd2ee8a82684860e320c0f6d5e15d31d916f")
 ("emacs-python-pytest" . "b603c5c7f21d351364deeb78e503d3a54d08a152")
 ("emacs-undo-fu" . "ab8bc10e424bccc847800c31ab41888db789d55d")
 ("emacs-which-key" . "9f64733e4ac563c0cda3685acf4e1c2cf600319b")
 ("emacs-winum" . "c5455e866e8a5f7eab6a7263e2057aff5f1118b9")
 ("emacsmirror-mirror" . "a122c213c5b3ff1bb7fd7995f07b7a18334a19e7")
 ("emacsql" . "c82a0e6b4d256a3743b718cfb640fa9efc045f6e")
 ("embark" . "c9b26c2e18f01ae401df6a69b7a0c1a6bc44b90c")
 ("envrc" . "456c4100de41d2cb50813058a9e727b6e83c5d1e")
 ("epl" . "78ab7a85c08222cd15582a298a364774e3282ce6")
 ("eros" . "dd8910279226259e100dab798b073a52f9b4233a")
 ("evil" . "b5c6950f65e2cde92bd978ec2bc98e67820d91a0")
 ("evil-cleverparens" . "8c45879d49bfa6d4e414b6c1df700a4a51cbb869")
 ("evil-collection" . "e6be41bed7b4399db116038c7f0bf2f484065b48")
 ("evil-goggles" . "08a22058fd6a167f9f1b684c649008caef571459")
 ("evil-iedit-state" . "93e4cbfcee802adbb9dd0ebd5836fea4fa932849")
 ("evil-indent-plus" . "0c7501e6efed661242c3a20e0a6c79a6455c2c40")
 ("evil-lisp-state" . "3c65fecd9917a41eaf6460f22187e2323821f3ce")
 ("evil-mc" . "246aecc17481dd23c172a9b845f02a9d9e322c7f")
 ("evil-nerd-commenter" . "63baf2d1c796edd11bbec5fe1dee711173d4155d")
 ("evil-org-mode" . "a9706da260c45b98601bcd72b1d2c0a24a017700")
 ("evil-snipe" . "a79177df406a79b4ffa25743c752f21363bba1cc")
 ("evil-surround" . "282a975bda83310d20a2c536ac3cf95d2bf188a5")
 ("exec-path-from-shell" . "3a8d97c096c2c5714b667130fd8a80d5622ee067")
 ("f.el" . "50af874cd19042f17c8686813d52569b1025c76a")
 ("flycheck" . "784f184cdd9f9cb4e3dbb997c09d93e954142842")
 ("gcmh" . "0089f9c3a6d4e9a310d0791cf6fa8f35642ecfd9")
 ("general.el" . "9651024e7f40a8ac5c3f31f8675d3ebe2b667344")
 ("git-timemachine" . "3381797bcbf906b18dff654a2361032d2d01b4a3")
 ("gnu-elpa-mirror" . "ebddf266c5234580c9458a139b419c5db1374793")
 ("goto-chg" . "a7c69fa6a33774ee8ca759a064845a88483a4995")
 ("helpful" . "f865f17ad04cd270685187b0a5331ec8eb06e541")
 ("highlight-indent-guides" . "cf352c85cd15dd18aa096ba9d9ab9b7ab493e8f6")
 ("hl-todo" . "42f744ffb513cf2b95517144c64dbf3fc69f711a")
 ("ht.el" . "c4c1be487d6ecb353d07881526db05d7fc90ea87")
 ("hydra" . "9e9e00cb240ea1903ffd36a54956b3902c379d29")
 ("iedit" . "3c7159a107b01b8f740ced72f10351b10bb69784")
 ("inheritenv" . "7e4c8b0d0a43b6f1c6c4d6dbd2f3bf5ce7f20067")
 ("isearch-mb" . "27c19935dd7f067c9feb9a5fda17844c39749346")
 ("kind-icon" . "6e0e0c5c2f846685861ef6c157044b1a55572359")
 ("let-alist" . "592553db5929b54db40af0df90c5add0aaca045b")
 ("lsp-mode" . "a82a4fa3467ec918273ab65d48c5c7d2dbfaec74")
 ("lsp-pyright" . "d428dbcf1802fbe147271c8dc74b073bd9cd7403")
 ("lsp-treemacs" . "72d367757a89453a712f6ba1df9b6e789ece2bbd")
 ("lsp-ui" . "21ce926eedd41ef305c2d89412506ce59b1a7eac")
 ("magit" . "2e73b66c2980abb9211d9881a8710c8ac5a33184")
 ("marginalia" . "9229d88ae4757f3439e81f51799758c009838cb4")
 ("markdown-mode" . "4469553a7395359e96b8796e1fac4de73cb6ccc4")
 ("melpa" . "4e3d46311b4d15314b6d1a0d5ff95c5f7e366223")
 ("modus-themes" . "fe5e1f7a16bae0df0cc305dcb3e5be32cf10f0b5")
 ("nix-mode" . "3d04d92d9c3896d07bc9fed7e4f40032025fbe7b")
 ("no-littering" . "665e324abb690fb50e9d255bc656eb12bb83b0c6")
 ("ob-async" . "9aac486073f5c356ada20e716571be33a350a982")
 ("olivetti" . "a31ac05a161a91fe5c157930b62a6c07037982ee")
 ("orderless" . "1ccf74ffdbb0dd34caa63022e92f947c09c49c86")
 ("org" . "b8656a2cef3d5da7270e391222d8139fc042edd5")
 ("org-appear" . "a4d10fc346ba14f487eb7aa95761b9295089ba55")
 ("org-fragtog" . "15861261a437aca2ec858317de71603d2957b423")
 ("org-reverse-datetree" . "e7a7109e4c34811d471bf685b710234564a556f6")
 ("org-roam" . "679ef6ef001fd1a69b691108178721aa913e7f0f")
 ("org-superstar-mode" . "03be6c0a3081c46a59b108deb8479ee24a6d86c0")
 ("org-tree-slide" . "917612a0d1593de533b7bf0a2792d7e37bb2ca3d")
 ("paredit" . "8330a41e8188fe18d3fa805bb9aa529f015318e8")
 ("persistent-scratch" . "57221e5fdff22985c0ea2f3e7c282ce823ea5932")
 ("persp-projectile" . "4e374d7650c7e041df5af5ac280a44d4a4ec705a")
 ("perspective-el" . "d8211a80fbc2cc0d9e163ef6a3e1d0a693b4e00e")
 ("pfuture" . "bde5b06795e3e35bfb2bba4c34b538d506a0856e")
 ("pkg-info" . "76ba7415480687d05a4353b27fea2ae02b8d9d61")
 ("posframe" . "80cb98aff695a102772cc414d96611bdaf96f00e")
 ("powerline" . "390a95fe5b71cfc20e18d034b4b35b5c159a83fc")
 ("projectile" . "24de2940a8a1f46a7715175a66be67733f1c8fa8")
 ("python-mode" . "dcb376044d020dfe30f8e4273e61863b7d9615ce")
 ("rainbow-delimiters" . "a32b39bdfe6c61c322c37226d66e1b6d4f107ed0")
 ("restart-emacs" . "1607da2bc657fe05ae01f7fdf26f716eafead02c")
 ("s.el" . "08661efb075d1c6b4fa812184c1e5e90c08795a9")
 ("shrink-path.el" . "c14882c8599aec79a6e8ef2d06454254bb3e1e41")
 ("smartparens" . "f59a40d54f35299007c396bd667ce3e9ec4714e3")
 ("spinner" . "34905eae12a236753fa88abc831eff1e41e8576e")
 ("straight.el" . "af5437f2afd00936c883124d6d3098721c2d306c")
 ("svg-lib" . "d736ea09d6aa7064ff974f5bee0f3aadc0d157d4")
 ("toml-mode.el" . "f6c61817b00f9c4a3cab1bae9c309e0fc45cdd06")
 ("transient" . "45241225cf6bec864964191c0b3dc8bfad989723")
 ("transpose-frame" . "12e523d70ff78cc8868097b56120848befab5dbc")
 ("tree-sitter-langs" . "3c0c82f9fb0a796f5ebd7e1e4c89f13d5ab6ef58")
 ("treemacs" . "deb7f2cd9eb06960798edd7393df2602902ed071")
 ("use-package" . "a7422fb8ab1baee19adb2717b5b47b9c3812a84c")
 ("vertico" . "9a3cdb754b018bd43a34fec464d4a88eae167c0e")
 ("vterm-toggle" . "ea0bfeaa200d9ed02b51bbbd83222657b02637e7")
 ("with-editor" . "36d36957628621e8340f755b22082e1f4ed8e2d7")
 ("xwwp" . "f67e070a6e1b233e60274deb717274b000923231")
 ("yaml-mode" . "a79d2a7b9281f8c56f461d717b1ba40fc58e22fd")
 ("yasnippet" . "5cbdbf0d2015540c59ed8ee0fcf4788effdf75b6"))
:beta
#+end_src

** Enable use-package statistics
:PROPERTIES:
:CUSTOM_ID: h:F75CE115-0722-49E4-9BD8-8A57BADAD080
:END:
If you'd like to see how many packages you've loaded, what stage of initialization they've reached, and how much aggregate time they've spent (roughly), you can enable ~use-package-compute-statistics~ after loading use-package but before any use-package forms, and then run the command M-x ~use-package-report~ to see the results. The buffer displayed is a tabulated list. You can use S in a column to sort the rows based on it.

#+BEGIN_SRC emacs-lisp
(setq use-package-compute-statistics t)
#+END_SRC

From the report:
- evil 0.56
- embark 0.25
- projectile 0.18
  
* Emacs
:PROPERTIES:
:CUSTOM_ID: h:BB41A3C4-8047-40D7-B99D-1BFDAC930D25
:header-args:    :emacs-lisp :tangle ./lisp/init-core.el
:END:
