readme.org
** Sane defaults
:PROPERTIES:
:CUSTOM_ID: h:94661C0F-79D0-4CD4-AA3F-CADB0E79398C
:END:
Inspired by https://github.com/natecox/dotfiles/blob/master/emacs/emacs.d/nathancox.org

To debug a LISP function use ~debug-on-entry~. You step /in/ with =d= and /over/ with =e=

#+BEGIN_SRC emacs-lisp
(use-package emacs
  :init
  (setq inhibit-startup-screen t
        initial-scratch-message nil
        sentence-end-double-space nil
        ring-bell-function 'ignore
        frame-resize-pixelwise t)

  (setq user-full-name "Luca Cambiaghi"
        user-mail-address "luca.cambiaghi@me.com")

  (setq read-process-output-max (* 1024 1024)) ;; 1mb

  ;; always allow 'y' instead of 'yes'.
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; default to utf-8 for all the things
  (set-charset-priority 'unicode)
  (setq locale-coding-system 'utf-8
        coding-system-for-read 'utf-8
        coding-system-for-write 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
  (setq default-process-coding-system '(utf-8-unix . utf-8-unix))

  ;; write over selected text on input... like all modern editors do
  (delete-selection-mode t)

  ;; enable recent files mode.
  (recentf-mode t)
  (setq recentf-exclude `(,(expand-file-name "straight/build/" user-emacs-directory)
                          ,(expand-file-name "eln-cache/" user-emacs-directory)
                          ,(expand-file-name "etc/" user-emacs-directory)
                          ,(expand-file-name "var/" user-emacs-directory)))

  ;; don't want ESC as a modifier
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  ;; Don't persist a custom file, this bites me more than it helps
  (setq custom-file (make-temp-file "")) ; use a temp file as a placeholder
  (setq custom-safe-themes t)            ; mark all themes as safe, since we can't persist now
  (setq enable-local-variables :all)     ; fix =defvar= warnings

  ;; stop emacs from littering the file system with backup files
  (setq make-backup-files nil
        auto-save-default nil
        create-lockfiles nil)

  ;; follow symlinks 
  (setq vc-follow-symlinks t)

  ;; don't show any extra window chrome
  (when (window-system)
    (tool-bar-mode -1)
    (toggle-scroll-bar -1))

  ;; enable winner mode globally for undo/redo window layout changes
  (winner-mode t)

  (show-paren-mode t)

  ;; less noise when compiling elisp
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
  (setq native-comp-async-report-warnings-errors nil)
  (setq load-prefer-newer t)


  ;; clean up the mode line
  (display-time-mode -1)
  (setq column-number-mode t)
  
  ;; use common convention for indentation by default
  (setq-default indent-tabs-mode t)
  (setq-default tab-width 2)

  ;; Enable indentation+completion using the TAB key.
  ;; Completion is often bound to M-TAB.
  (setq tab-always-indent 'complete)
  )
#+END_SRC

** custom variables
:PROPERTIES:
:CUSTOM_ID: h:AC160303-DF53-4597-9BAA-3AE1E7E13431
:END:
#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq lc/is-ipad ( 	;; <
                    > (length (shell-command-to-string "uname -a | grep iPad")) 0))

  (setq lc/is-windows (eq system-type 'windows-nt))

  (defcustom lc/default-font-family "fira code" 
    "Default font family"
    :type 'string
    :group 'lc)

  (defcustom lc/variable-pitch-font-family "Sans Serif" ;; "cantarell" ;; 
    "Variable pitch font family"
    :type 'string
    :group 'lc)
  
  (defcustom lc/laptop-font-size
		(if lc/is-windows 100 150)
    "Font size used for laptop"
    :type 'int
    :group 'lc)

  (defcustom lc/theme nil
    "Current theme (light or dark)"
    :type 'symbol
    :options '(light dark)
    :group 'lc)
  
  ;; (setq lc/is-low-power (string= (system-name) "pntk"))

  
  ;; (setq lc/is-slow-ssh (string= (getenv "IS_TRAMP") "true"))
  
  )
#+end_src

** Font
:PROPERTIES:
:CUSTOM_ID: h:3CDD0539-5A95-468C-85F0-71B391D7115D
:END:
#+begin_src emacs-lisp
(use-package emacs
	:init
	(defun lc/get-font-size ()
		"font size is calculated according to the size of the primary screen"
		(let* (;; (command "xrandr | awk '/primary/{print sqrt( ($(nf-2)/10)^2 + ($nf/10)^2 )/2.54}'")
					 (command "osascript -e 'tell application \"finder\" to get bounds of window of desktop' | cut -d',' -f3")
					 (screen-width (string-to-number (shell-command-to-string command))))  ;;<
      (if (> screen-width 2560) lc/laptop-font-size lc/laptop-font-size))) 
	
  ;; Main typeface
  (set-face-attribute 'default nil :font lc/default-font-family :height (lc/get-font-size))
  ;; Set the fixed pitch face (monospace)
  (set-face-attribute 'fixed-pitch nil :font lc/default-font-family)
  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font lc/variable-pitch-font-family)
	)
#+end_src

** COMMENT Adjust font size
:PROPERTIES:
:CUSTOM_ID: h:D9DB7FA2-18C6-46A9-9567-1FEFADD523AC
:END:
#+begin_src emacs-lisp
(use-package emacs
	:init
	(defun lc/adjust-font-size (height)
		"Adjust font size by given height. If height is '0', reset font
size. This function also handles icons and modeline font sizes."
		(interactive "nHeight ('0' to reset): ")
		(let ((new-height (if (zerop height)
													(lc/get-font-size)
												(+ height (face-attribute 'default :height)))))
			(set-face-attribute 'default nil :height new-height)
			(set-face-attribute 'fixed-pitch nil :height new-height)
			(set-face-attribute 'variable-pitch nil :height new-height)
			(set-face-attribute 'mode-line nil :height new-height)
			(set-face-attribute 'mode-line-inactive nil :height new-height)
			(message "Font size: %s" new-height)))

	(defun lc/increase-font-size ()
		"Increase font size by 0.5 (5 in height)."
		(interactive)
		(lc/adjust-font-size 5))

	(defun lc/decrease-font-size ()
		"Decrease font size by 0.5 (5 in height)."
		(interactive)
		(lc/adjust-font-size (- 5)))

	(defun lc/reset-font-size ()
		"Reset font size according to the `lc/default-font-size'."
		(interactive)
		(lc/adjust-font-size 0))
	)
#+end_src

** Zoom
:PROPERTIES:
:CUSTOM_ID: h:f73c5fb4-246e-423c-8cfd-0482dcb1f699
:END:
#+begin_src emacs-lisp
(use-package emacs
  :init
  (global-set-key (kbd "C-=") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)
  )
#+end_src

** macOS
:PROPERTIES:
:CUSTOM_ID: h:7BA73F60-D31F-4A96-9DEE-02A4FC1BEE8B
:END:
#+BEGIN_SRC emacs-lisp
(use-package emacs
  :init
  (defun lc/is-macos ()
    (and (eq system-type 'darwin)
         (= 0 (length (shell-command-to-string "uname -a | grep iPad")))))
  (when (lc/is-macos)
    (setq mac-command-modifier 'super)     ; command as super
    (setq mac-option-modifier 'meta)     ; alt as meta
    (setq mac-control-modifier 'control)
    )
	;; when on emacs-mac 
	(when (fboundp 'mac-auto-operator-composition-mode)
      (mac-auto-operator-composition-mode)   ;; enables font ligatures
      (global-set-key [(s c)] 'kill-ring-save)
      (global-set-key [(s v)] 'yank)
      (global-set-key [(s x)] 'kill-region)
      (global-set-key [(s q)] 'kill-emacs)
      )
	)
#+END_SRC

** Garbage collector magic hack
:PROPERTIES:
:CUSTOM_ID: h:A17DC2B8-4E73-4F43-BD6E-07ADAEC9A3A7
:END:
Used by DOOM to manage garbage collection
#+BEGIN_SRC emacs-lisp
(use-package gcmh
  :demand
  :config
  (gcmh-mode 1))
#+END_SRC

** helpful
:PROPERTIES:
:CUSTOM_ID: h:273CA7B2-AE07-4571-AB4A-92523B11DB41
:END:
#+BEGIN_SRC emacs-lisp
  (use-package helpful
    :after evil
    :init
    (setq evil-lookup-func #'helpful-at-point)
    :bind
    ([remap describe-function] . helpful-callable)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))
#+END_SRC

** eldoc
:PROPERTIES:
:CUSTOM_ID: h:FC10A86D-86E6-45C2-8759-ADE233B0D80C
:END:
#+begin_src emacs-lisp
  (use-package eldoc
    :hook (emacs-lisp-mode cider-mode))
#+end_src

** exec path from shell
:PROPERTIES:
:CUSTOM_ID: h:B1611A44-8567-4370-80B4-9D904434E274
:END:
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    ;; :if (memq window-system '(mac ns))
    :if (lc/is-macos)
    :hook (emacs-startup . (lambda ()
                             (setq exec-path-from-shell-arguments '("-l")) ; removed the -i for faster startup
                             (exec-path-from-shell-initialize)))
    ;; :config
    ;; (exec-path-from-shell-copy-envs
    ;;  '("GOPATH" "GO111MODULE" "GOPROXY"
    ;;    "NPMBIN" "LC_ALL" "LANG" "LC_TYPE"
    ;;    "SSH_AGENT_PID" "SSH_AUTH_SOCK" "SHELL"
    ;;    "JAVA_HOME"))
    )
#+end_src

** no littering
:PROPERTIES:
:CUSTOM_ID: h:2DB2921D-434E-4321-A15E-4B3329ABC946
:END:
#+begin_src emacs-lisp
(use-package no-littering
  :demand
  :config
  (with-eval-after-load 'recentf
    (add-to-list 'recentf-exclude no-littering-var-directory)
    (add-to-list 'recentf-exclude no-littering-etc-directory))
  )
#+end_src

** server mode
:PROPERTIES:
:CUSTOM_ID: h:5F50A0A6-0C8E-4804-BBF5-A8D9B1372F12
:END:
#+begin_src emacs-lisp
(use-package emacs
	:init
	(unless (and (fboundp 'server-running-p)
               (server-running-p))
    (server-start)))
#+end_src

