lisp/init-org-export.el
;; [[file:../readme.org::#h:89A2FA66-9647-4BF8-A45C-EA61D5D95FDC][org-html-themify:1]]
(use-package org-html-themify
  :after modus-themes
  :straight
  (org-html-themify
   :type git
   :host github
   :repo "DogLooksGood/org-html-themify"
   :files ("*.el" "*.js" "*.css"))
  :hook (org-mode . org-html-themify-mode)
  :init
  (setq org-html-themify-themes
        '((light . modus-operandi)
          (dark . modus-operandi)))
  :config
  ;; otherwise it complains about invalid face
  (require 'hl-line)
  
  )

(use-package htmlize
  :after org-html-themify)
;; org-html-themify:1 ends here

;; [[file:../readme.org::#h:021F6686-3272-4900-BB50-CB98C5C5C2BA][ox-gfm:1]]
(use-package ox-gfm
	:commands (org-gfm-export-as-markdown org-gfm-export-to-markdown)
	:after org
	)
;; ox-gfm:1 ends here
