lisp/init-org-export.el

;; [[file:../readme.org::#h:F97C3D33-1B2E-4D80-BD51-E4052A5535DE][ox-ipynb:1]]
(use-package ox-ipynb
  :straight (ox-ipynb :type git :host github :repo "jkitchin/ox-ipynb")
	:commands (ox-ipynb-export-org-file-to-ipynb-file))
;; ox-ipynb:1 ends here

;; [[file:../readme.org::#h:6181675A-C397-4449-A8D9-AFDAECD6D4EE][ox-reveal:1]]
(use-package org-re-reveal
  :after org
  :init
  ;; (setq org-re-reveal-root (expand-file-name "../../" (locate-library "dist/reveal.js" t))
  ;;       org-re-reveal-revealjs-version "4")
  (setq org-re-reveal-root "./reveal.js"
        org-re-reveal-revealjs-version "3.8"
        org-re-reveal-external-plugins  '((progress . "{ src: '%s/plugin/toc-progress/toc-progress.js', async: true, callback: function() { toc_progress.initialize(); toc_progress.create();} }"))
        ))
;; ox-reveal:1 ends here

;; [[file:../readme.org::#h:8739EFFA-1436-4DF9-AD0D-AD0C94144A40][weblorg:1]]
(use-package weblorg)

(use-package templatel)

(use-package htmlize)
;; weblorg:1 ends here

;; [[file:../readme.org::#h:9AB653A8-CACD-45B4-A330-7EB2421370E6][ox-cv:1]]
(use-package ox-altacv
  :straight (ox-altacv :type git :host github :repo "lccambiaghi/org-cv")
  :config (require 'ox-altacv))
;; ox-cv:1 ends here

;; [[file:../readme.org::#h:A646A19B-12BC-4B95-A592-BCB640E10659][init-org-export:1]]
(provide 'init-org-export)
