readme.org
** COMMENT centaur tabs
:PROPERTIES:
:CUSTOM_ID: h:44BB321D-0EB1-4E28-AD98-55621DC07597
:END:
#+begin_src emacs-lisp
(use-package centaur-tabs
  :hook (emacs-startup . centaur-tabs-mode)
  :general
  (general-nmap "gt" 'centaur-tabs-forward
    "gT" 'centaur-tabs-backward)
  (lc/leader-keys
    "b K" '(centaur-tabs-kill-other-buffers-in-current-group :wk "kill other buffers"))
  :init
  (setq centaur-tabs-set-icons t)
  (setq centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "M"
        centaur-tabs-cycle-scope 'tabs)
  (setq centaur-tabs-set-close-button nil)
  (setq centaur-tabs-enable-ido-completion nil)
  :config
  (centaur-tabs-mode t)
  ;; (centaur-tabs-headline-match)
  (centaur-tabs-group-by-projectile-project)
  )
#+end_src

** COMMENT bespoke modeline
:PROPERTIES:
:CUSTOM_ID: h:4857520F-F4E7-4959-9162-505E93C94F21
:END:
#+begin_src emacs-lisp
(use-package bespoke-modeline
  :straight (:type git :host github :repo "mclear-tools/bespoke-modeline") 
  :demand
  :init
  ;; Set header line
  (setq bespoke-modeline-position 'top)
  ;; Set mode-line height
  (setq bespoke-modeline-size 3)
  ;; Show diff lines in mode-line
  (setq bespoke-modeline-git-diff-mode-line nil)
  ;; Set mode-line cleaner
  (setq bespoke-modeline-cleaner t)
  ;; Use mode-line visual bell
  (setq bespoke-modeline-visual-bell t)
  ;; Set vc symbol
  ;; (setq  bespoke-modeline-vc-symbol "G:")
  :config
  (bespoke-modeline-mode)
  ;; (set-face-attribute 'bespoke-modeline-inactive-status-RO nil :box        'unspecified)
  ;; (set-face-attribute 'bespoke-modeline-inactive-status-** nil :box        'unspecified)
  ;; (set-face-attribute 'bespoke-modeline-inactive-status-RW nil :box        'unspecified)
  ;; (set-face-attribute 'bespoke-modeline-inactive-secondary nil :bacground        '#3c4353)
  ;; (set-face-attribute 'bespoke-modeline-inactive-secondary nil :bacground        '#3c4353)
  )

#+end_src

** COMMENT bespoke theme
:PROPERTIES:
:CUSTOM_ID: h:EAC1CA44-DBF8-4BC9-A3FF-C55F06B60C07
:END:
NOTE:
- requires Symbola font: https://fontlibrary.org/en/font/symbola
#+begin_src emacs-lisp
(use-package bespoke-themes
  :demand
  :straight (:host github :repo "mclear-tools/bespoke-themes" :branch "main")
	:init
	(defun what-face (pos)
  (interactive "d")
  (let ((face (or (get-char-property (point) 'read-face-name)
                  (get-char-property (point) 'face))))
    (if face (message "Face: %s" face) (message "No face at %d" pos))))
  :config
  ;; Set evil cursor colors
  (setq bespoke-set-evil-cursors t)
  ;; Set use of italics
  (setq bespoke-set-italic-comments t
        bespoke-set-italic-keywords t)
  ;; Set variable pitch
  (setq bespoke-set-variable-pitch t)
  ;; Set initial theme variant
  (setq bespoke-set-theme 'dark)
  ;; Load theme
  (load-theme 'bespoke t)
	)

;; Vertical window divider
(use-package frame
  :straight (:type built-in)
  ;; Make sure new frames use window-divider
  :hook (before-make-frame . window-divider-mode)
  :custom
  (window-divider-default-right-width 12)
  (window-divider-default-bottom-width 1)
  (window-divider-default-places 'right-only)
  (window-divider-mode t)
  :config
  (setq-default default-frame-alist
                (append (list
                         ;; '(font . "SF Mono:style=medium:size=15") ;; NOTE: substitute whatever font you prefer here
                         '(internal-border-width . 20)
                         ;; '(left-fringe    . 0)
                         '(right-fringe   . 0)
                         '(tool-bar-lines . 0)
                         '(menu-bar-lines . 0)
                         '(vertical-scroll-bars . nil))))
  (setq-default window-resize-pixelwise t)
  (setq-default frame-resize-pixelwise t)
  )

(use-package fontset
  :straight (:type built-in) ;; only include this if you use straight
  :config
  ;; Use symbola for proper unicode
  (when (member "Symbola" (font-family-list))
    (set-fontset-font
     t 'symbol "Symbola" nil 'prepend)))
#+end_src

** COMMENT rainbow-mode
:PROPERTIES:
:CUSTOM_ID: h:CBF37512-DDB2-4FC5-88C7-F997A67064D5
:END:
#+begin_src emacs-lisp
(use-package rainbow-mode
:config
(rainbow-mode)
	)
#+end_src

** COMMENT stimmung themes
:PROPERTIES:
:CUSTOM_ID: h:8346727C-A954-4C8B-B002-BCB942B0980C
:END:
#+begin_src emacs-lisp
(use-package stimmung-themes
  :straight (stimmung-themes :host github :repo "motform/stimmung-themes") ; if you are a straight shooter
  :demand
  :config
  (load-theme 'stimmung-themes-light t)
  ;; (load-theme 'stimmung-themes-dark t)
  )
#+end_src

** COMMENT simple modeline
:PROPERTIES:
:CUSTOM_ID: h:72CD809A-97CD-4CA7-918C-DC5946C66ED3
:END:
#+begin_src emacs-lisp
(use-package emacs
  :init
  (defun simple-mode-line-render (left right)
    "Return a string of `window-width' length.
Containing LEFT, and RIGHT aligned respectively."
    (let ((available-width
           (- (window-total-width)
              (+ (length (format-mode-line left))
                 (length (format-mode-line right))))))
      (append left
              (list (format (format "%%%ds" available-width) ""))
              right)))
  ;; Display to mode-line buffer name relative to current-project.
  ;; SOURCE: https://www.reddit.com/r/emacs/comments/8xobt3/tip_in_modeline_show_buffer_file_path_relative_to/
  (with-eval-after-load 'subr-x
    (setq-default mode-line-buffer-identification
                  '(:eval
                    (format-mode-line
                     (propertized-buffer-identification
                      (or (when-let* ((buffer-file-truename buffer-file-truename)
                                      (prj                  (cdr-safe (project-current)))
                                      (prj-parent           (file-name-directory (directory-file-name (expand-file-name prj)))))
                            (concat (file-relative-name (file-name-directory buffer-file-truename) prj-parent) (file-name-nondirectory buffer-file-truename)))
                          "%b"))))))

  (setq-default column-number-mode t
                mode-line-format   '((:eval (simple-mode-line-render '("%e" ; left side
                                                                       mode-line-front-space
                                                                       mode-line-modified
                                                                       mode-line-remote
                                                                       mode-line-frame-identification
                                                                       mode-line-buffer-identification
                                                                       "   "
                                                                       "%l:%c")
                                                                     '("%"
                                                                       mode-line-misc-info  ; right side
                                                                       "  "
                                                                       mode-line-process
                                                                       mode-line-end-spaces
                                                                       "  ")))))
  )
#+end_src

