readme.org
** Highlight indentation guides
:PROPERTIES:
:CUSTOM_ID: h:98E70637-DC1F-4528-B848-C12D5092BD7A
:END:
#+BEGIN_SRC emacs-lisp
;; add a visual intent guide
(use-package highlight-indent-guides
  :hook (prog-mode . highlight-indent-guides-mode)
  :init
  ;; (setq highlight-indent-guides-method 'column)
  ;; (setq highlight-indent-guides-method 'bitmap)
  (setq highlight-indent-guides-method 'character)
  (setq highlight-indent-guides-character ?)
  (setq highlight-indent-guides-responsive 'top)
  ;; (setq highlight-indent-guides-responsive 'stack)
	;; (setq highlight-indent-guides-auto-enabled nil)
	;; (set-face-background 'highlight-indent-guides-odd-face "darkgray")
  ;; (set-face-background 'highlight-indent-guides-even-face "dimgray")
  ;; (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
  )
#+END_SRC

** Enlarge window
:PROPERTIES:
:CUSTOM_ID: h:2D8DEB14-A1F1-4B46-B08A-CF97A0A9B237
:END:
Taken from DOOM

#+begin_src emacs-lisp
(use-package emacs
	:general
  (lc/leader-keys
    "w o" '(doom/window-enlargen :wk "enlargen"))
	:init
	(defun doom/window-enlargen (&optional arg)
		"Enlargen the current window to focus on this one. Does not close other
windows (unlike `doom/window-maximize-buffer'). Activate again to undo."
		(interactive "P")
		(let ((param 'doom--enlargen-last-wconf))
			(cl-destructuring-bind (window . wconf)
					(or (frame-parameter nil param)
							(cons nil nil))
				(set-frame-parameter
				 nil param
				 (if (and (equal window (selected-window))
									(not arg)
									wconf)
						 (ignore
							(let ((source-window (selected-window)))
								(set-window-configuration wconf)
								(when (window-live-p source-window)
									(select-window source-window))))
					 (prog1 (cons (selected-window) (or wconf (current-window-configuration)))
						 (let* ((window (selected-window))
										(dedicated-p (window-dedicated-p window))
										(preserved-p (window-parameter window 'window-preserved-size))
										(ignore-window-parameters t)
										(window-resize-pixelwise nil)
										(frame-resize-pixelwise nil))
							 (unwind-protect
									 (progn
										 (when dedicated-p
											 (set-window-dedicated-p window nil))
										 (when preserved-p
											 (set-window-parameter window 'window-preserved-size nil))
										 (maximize-window window))
								 (set-window-dedicated-p window dedicated-p)
								 (when preserved-p
									 (set-window-parameter window 'window-preserved-size preserved-p))
								 (add-hook 'doom-switch-window-hook #'doom--enlargened-forget-last-wconf-h)))))))))
	)

#+end_src

** 8 colors theme
:PROPERTIES:
:CUSTOM_ID: h:EA99CF6B-278E-482F-A865-7E31407734CE
:END:
When using ~emacs~ on my jailbroken iPad, I cannot set ~TERM=xterm-256color~ because of some ~terminfo~ error.
I therefore do what I can with the 8 colors I can use.

The default theme ~manoj-dark~ does a pretty good job OOTB.
I add a few manual tweaks.
The theme defintion gets saved in ~custom-theme-directory~.

#+begin_src emacs-lisp :tangle themes/8colors-theme.el
(deftheme 8colors
  "Theme using only 8 colors")

;; (custom-theme-set-variables
;;   '8colors
;;   '(overline-margin 0)
;; )

(custom-theme-set-faces
 '8colors
 '(centaur-tabs-unselected ((t (:foreground "white" :background "black"))) t)
 '(centaur-tabs-unselected-modified ((t (:foreground "white" :background "black"))) t)
 '(tool-bar ((t (:background "black"))) t)
 '(selectrum-current-candidate ((t (:background "blue"))) t)
 '(org-code ((t (:foreground "magenta"))) t)
 '(org-special-keyword ((t (:foreground "magenta"))) t)
 '(mode-line ((t (:background "black"))) t)
 '(doom-modeline-buffer-file ((t (:background "black"))) t)
 '(tab-line ((t (:background "black"))) t)
 '(magit-diff-removed-highlight ((t (:background "red" :foreground "white"))) t)
 '(magit-diff-added-highlight ((t (:background "green" :foreground "white"))) t)
 '(magit-hash ((t (:background "black" :foreground "white"))) t)
 '(iedit-occurrence ((t (:background "blue" :foreground "white"))) t)
 )

(provide-theme '8colors)
#+end_src

#+begin_src emacs-lisp
(use-package emacs
  :init
  (unless (> (display-color-cells) 8)
    (setq custom-theme-directory (concat user-emacs-directory "themes"))
    (custom-set-variables '(custom-enabled-themes '(8colors manoj-dark)))
    ))
#+end_src

** COMMENT Fancy titlebar for macOS
:PROPERTIES:
:CUSTOM_ID: h:73688165-BE4C-411D-904C-2DD65E56766E
:END:
#+BEGIN_SRC emacs-lisp
(use-package emacs
  :init
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . dark))
  (setq ns-use-proxy-icon  nil)
  (setq frame-title-format nil)
  )
#+END_SRC

** COMMENT Show emoji on macOS
:PROPERTIES:
:CUSTOM_ID: h:CDFFE28E-AD1A-4C9D-9B70-EF7D1E22CE56
:END:
You can use ~insert-char~ to insert the emoji or ~emojify-insert-emoji~

#+begin_src emacs-lisp
(use-package emojify
  :commands (emojify-insert-emoji)
  :hook (after-init . global-emojify-mode)
  :config
  (when (member "Apple Emoji" (font-family-list))
    (set-fontset-font
     t 'symbol (font-spec :family "Apple Emoji") nil 'prepend))
  )


#+end_src

** COMMENT Alerts
:PROPERTIES:
:CUSTOM_ID: h:17A9115B-AB79-4445-9F12-EFD086750CDA
:END:
#+begin_src emacs-lisp
(use-package alert
  :if (lc/is-macos)
  :config
  (setq
   ;; alert-default-style 'notifier
   alert-default-style 'osx-notifier
   )
  ;; (alert "This is an alert" :severity 'high)
  ;; (alert "This is an alert" :title "My Alert" :category 'debug)
  )
#+end_src

* Completion framework
:PROPERTIES:
:CUSTOM_ID: h:06E0EA9F-7CF4-4B99-8A4A-2C63A4F8A6B6
:header-args:    :emacs-lisp :tangle ./lisp/init-core.el
:END:
** marginalia
:PROPERTIES:
:CUSTOM_ID: h:37ACBBF7-989F-4A57-9454-06B79B8EB4F0
:END:
#+BEGIN_SRC emacs-lisp
(use-package marginalia
  :after vertico
  :init
  (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  (marginalia-mode)
  (with-eval-after-load 'projectile
    (add-to-list 'marginalia-command-categories '(projectile-find-file . file)))
  )
#+END_SRC

** embark
:PROPERTIES:
:CUSTOM_ID: h:D28488FC-484F-4AD9-8989-736BE88C9AA2
:END:
NOTE:
- You can act on candidates with =C-l= 
- You can run ~embark-export~ on all results (e.g. after a ~consult-line~) with =C-l E=
  + You can run ~embark-export-snapshot~ with =C-l S=

#+BEGIN_SRC emacs-lisp
(use-package embark
  :after vertico
  :general
  (general-nmap "C-l" 'embark-act)
  (vertico-map
   "C-l" #'embark-act
   )
  (:keymaps 'embark-file-map
            ;; "o" 'find-file-other-window
            "x" 'lc/dired-open-externally
						)	
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)
  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none))))
  ;; (add-hook 'embark-setup-hook 'selectrum-set-selected-candidate)
  )
#+END_SRC

** wgrep
:PROPERTIES:
:CUSTOM_ID: h:61053422-6027-47A9-8175-8F8479F78E5F
:END:
After running ~embark-export~, we can edit the results with ~wgrep~ and commit the edits.
This is extremely powerful for refactorings such as changing the name of a class or a function across files in the project.

#+begin_src emacs-lisp
(use-package wgrep
  :general
  (grep-mode-map "W" 'wgrep-change-to-wgrep-mode)
  :init
  (setq wgrep-auto-save-buffer t)
  (setq wgrep-change-readonly-file t)
  )
#+end_src

** consult
:PROPERTIES:
:CUSTOM_ID: h:E08EB7E2-CBD9-460C-B77E-9EFF7846C249
:END:
NOTE:
- After =consult-line= you can press =M-n= twice to search for the symbol at point

#+BEGIN_SRC emacs-lisp
(use-package consult
  :commands (consult-ripgrep)
  :general
  (general-nmap
    :states '(normal insert)
    "C-p" 'consult-yank-pop)
  (lc/leader-keys
    "s i" '(consult-isearch :wk "isearch")
    "s o" '(consult-outline :which-key "outline")
    "s s" 'consult-line
    "s p" '(consult-ripgrep :wk "ripgrep project")
    "b b" 'consult-buffer
    ;; TODO consult mark
    "f r" 'consult-recent-file
    ;; "s !" '(consult-flymake :wk "flymake")
    )
  :init
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)	
  ;; (setq consult-preview-key "C-l")
  ;; (setq consult-narrow-key ">")
  :config
  (autoload 'projectile-project-root "projectile")
  (setq consult-project-root-function #'projectile-project-root)
  (with-eval-after-load 'selectrum
    (require 'consult-selectrum))
  )	
#+END_SRC

** embark-consult
:PROPERTIES:
:CUSTOM_ID: h:002E04ED-FEBA-4058-8570-561963C2450F
:END:
#+begin_src emacs-lisp
(use-package embark-consult
  :after (embark consult)
  ;; :demand t ; only necessary if you have the hook below
  ;; if you want to have consult previews as you move around an
  ;; auto-updating embark collect buffer
  ;; :hook
  ;; (embark-collect-mode . embark-consult-preview-minor-mode)
	)
#+end_src

