readme.org
** undo fu
:PROPERTIES:
:CUSTOM_ID: h:FEB4E3B3-47E7-4AAE-ADD7-524A57387301
:END:
#+begin_src emacs-lisp
(use-package undo-fu
  :demand
  :general
  (:states 'normal
           "u" 'undo-fu-only-undo
           "s-z" 'undo-fu-only-undo
           "\C-r" 'undo-fu-only-redo))
#+end_src

** git                                                                  :git:
:PROPERTIES:
:CUSTOM_ID: h:0D3218A4-4F45-4C20-9320-087750D5A961
:END:
*** magit
:PROPERTIES:
:CUSTOM_ID: h:61B8B839-46CA-4AE6-AD57-A6D291E7C225
:END:
50/72 rule for commit messages: https://www.midori-global.com/blog/2018/04/02/git-50-72-rule

~magit-cycle-margin-style~ to show more precise commit timestamps

On iPad, we may need to ~(require 'sendmail)~ before calling ~magit-status~

#+BEGIN_SRC emacs-lisp
(use-package magit
  :general
  (lc/leader-keys
    "g b" 'magit-blame
    "g g" 'magit-status
    "g G" 'magit-status-here
    "g l" 'magit-log)
  (general-nmap
    :keymaps '(magit-status-mode-map
               magit-stash-mode-map
               magit-revision-mode-map
               magit-process-mode-map
               magit-diff-mode-map)
    "TAB" #'magit-section-toggle
    "<escape>" #'transient-quit-one)
  :init
  (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  (setq magit-log-arguments '("--graph" "--decorate" "--color"))
  (setq git-commit-fill-column 72)
	;; (setq magit-log-margin (t "%Y-%m-%d %H:%M " magit-log-margin-width t 18))
	;; (when lc/is-ipad (require 'sendmail))
  :config
	(setq magit-buffer-name-format (concat "*" magit-buffer-name-format "*"))
  (evil-define-key* '(normal visual) magit-mode-map
    "zz" #'evil-scroll-line-to-center)
  )
#+END_SRC

*** COMMENT forge
:PROPERTIES:
:CUSTOM_ID: h:6776E02F-A2E6-4BBA-91A1-81EEE4CFB3AB
:END:
#+BEGIN_SRC emacs-lisp
;; NOTE: Make sure to configure a GitHub token before using this package!
;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
(use-package forge :after magit)
#+END_SRC

*** git-timemachine
:PROPERTIES:
:CUSTOM_ID: h:5CA4BCDE-A8D6-472F-9FA1-FA5514CC9388
:END:
#+begin_src emacs-lisp
  (use-package git-timemachine
    :hook (git-time-machine-mode . evil-normalize-keymaps)
    :init (setq git-timemachine-show-minibuffer-details t)
    :general
    (general-nmap "SPC g t" 'git-timemachine-toggle)
    (git-timemachine-mode-map
     "C-k" 'git-timemachine-show-previous-revision
     "C-j" 'git-timemachine-show-next-revision
     "q" 'git-timemachine-quit))
#+end_src

*** diff-hl
:PROPERTIES:
:CUSTOM_ID: h:DA2BAD8C-A37A-4A89-BEE0-A7FB367CD345
:END:
When an heading includes a change, the ~org-ellipsis~ not shown correctly.
This is caused by an empty line with ~diff-hl~ fringe that gets appended to the heading.
To work around this and show the ellipsis, you have to add a whitespace in that empty line.

#+begin_src emacs-lisp
(use-package diff-hl
  :demand
	:general
	(lc/leader-keys
    "g n" '(diff-hl-next-hunk :wk "next hunk")
    "g p" '(diff-hl-previous-hunk :wk "prev hunk"))
  :hook
  ((magit-pre-refresh . diff-hl-magit-pre-refresh)
   (magit-post-refresh . diff-hl-magit-post-refresh))
  :init
  (setq diff-hl-draw-borders nil)
	;; (setq diff-hl-global-modes '(not org-mode))
  ;; (setq diff-hl-fringe-bmp-function 'diff-hl-fringe-bmp-from-type)
  ;; (setq diff-hl-global-modes (not '(image-mode org-mode)))
  :config
  (global-diff-hl-mode)
  )
#+end_src

:PROPERTIES:
:CUSTOM_ID: h:6C6EA9DD-42EE-49CD-A7FC-5BE9FAB42F7F
:END:
*** smerge + hydra-smerge
:PROPERTIES:
:CUSTOM_ID: h:DADD41F3-F805-4E89-9EDB-B21350A81A19
:END:
#+begin_src emacs-lisp
(use-package hydra
	:after evil
  :demand
  :general
  (lc/leader-keys "w w" 'evil-windows-hydra/body)
  :init
  (defhydra evil-windows-hydra (:hint nil
                                      ;; :pre (smerge-mode 1)
                                      ;; :post (smerge-auto-leave)
                                      )
    "
 [_h_]  decrease width [_l_]  increase width
 [_j_] decrease height [_k_] increase height
 [_q_] quit"
    ("h" evil-window-decrease-width)
    ("l" evil-window-increase-width)
    ("j" evil-window-decrease-height)
    ("k" evil-window-increase-height)
    ("q" nil :color blue)
    )
  )

(use-package smerge-mode
  :straight (:type built-in)
  :after hydra
  :general
  (lc/leader-keys "g m" 'smerge-hydra/body)
  :hook
  (magit-diff-visit-file . (lambda ()
                             (when smerge-mode
                               (smerge-hydra/body))))
  :init
  (defhydra smerge-hydra (:hint nil
                                :pre (smerge-mode 1)
                                ;; Disable `smerge-mode' when quitting hydra if
                                ;; no merge conflicts remain.
                                :post (smerge-auto-leave))
    "
                                                    
  Movement   Keep           Diff              Other  smerge 
  
     ^_g_^       [_b_] base       [_<_] upper/base    [_C_] Combine
     ^_C-k_^     [_u_] upper      [_=_] upper/lower   [_r_] resolve
     ^_k_ ^     [_l_] lower      [_>_] base/lower    [_R_] remove
     ^_j_ ^     [_a_] all        [_H_] hightlight
     ^_C-j_^     [_RET_] current  [_E_] ediff             
     ^_G_^                                             [_q_] quit"
    ("g" (progn (goto-char (point-min)) (smerge-next)))
    ("G" (progn (goto-char (point-max)) (smerge-prev)))
    ("C-j" smerge-next)
    ("C-k" smerge-prev)
    ("j" next-line)
    ("k" previous-line)
    ("b" smerge-keep-base)
    ("u" smerge-keep-upper)
    ("l" smerge-keep-lower)
    ("a" smerge-keep-all)
    ("RET" smerge-keep-current)
    ("\C-m" smerge-keep-current)
    ("<" smerge-diff-base-upper)
    ("=" smerge-diff-upper-lower)
    (">" smerge-diff-base-lower)
    ("H" smerge-refine)
    ("E" smerge-ediff)
    ("C" smerge-combine-with-next)
    ("r" smerge-resolve)
    ("R" smerge-kill-current)
    ("q" nil :color blue)))
#+end_src

** emacs tree-sitter                                       :prog_tree_sitter:
:PROPERTIES:
:CUSTOM_ID: h:1FD9CDF3-4C5D-450E-99DE-034077C3D8BC
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-tree-sitter.el
:END:
#+BEGIN_SRC emacs-lisp
(use-package tree-sitter
  ;; :straight (tree-sitter :host github :repo "ubolonton/emacs-tree-sitter" :depth full)
  :hook (python-mode . (lambda ()
                         (require 'tree-sitter)
                         (require 'tree-sitter-langs)
                         (require 'tree-sitter-hl)
                         (tree-sitter-hl-mode)
                         )))

(use-package tree-sitter-langs)
#+END_SRC

** envrc                                                             :direnv:
:PROPERTIES:
:CUSTOM_ID: h:65206410-8DD7-499E-AA70-6D9C781C0E0D
:END:
Running ~direnv~ is expensive so I only do it when it is necessary. I need it in two situations:
- ~python-mode~
- ~ob-jupyter~

Instead of simply enabling ~envrc-mode~ in every org buffer, I check with the buffer includes a ~jupyter-python~ block.
In the [[*ob-jupyter][ob-jupyter]] section I then load ~ob-jupyter~ only when ~envrc-mode~ is loaded and ~jupyter~ is found on the ~PATH~

#+begin_src emacs-lisp
(use-package inheritenv
  :straight (inheritenv :type git :host github :repo "purcell/inheritenv"))
#+end_src

#+begin_src emacs-lisp
(use-package envrc
  :straight (envrc :type git :host github :repo "purcell/envrc")
  :commands (envrc-mode)
  :hook ((python-mode . envrc-mode)
         (org-jupyter-mode . envrc-mode))
  )
#+end_src

** snippets                                                       :yasnippet:
:PROPERTIES:
:CUSTOM_ID: h:8E2A5EAF-B690-457E-86E7-9070B51297A7
:END:
*** yasnippet
:PROPERTIES:
:CUSTOM_ID: h:ae484d90-a853-4e7a-a073-42485a76f0aa
:END:
We use =C-TAB= to expand snippets instead of =TAB= .

You can have ~#condition: 'auto~ for the snippet to auto-expand.

See [[http://joaotavora.github.io/yasnippet/snippet-organization.html#org7468fa9][here]] to share snippets across modes

#+begin_src emacs-lisp
(use-package yasnippet
  :general
  (yas-minor-mode-map
   :states 'insert
   "TAB" 'nil
   "C-TAB" 'yas-expand)
  :hook
  ((prog-mode org-mode dap-ui-repl-mode vterm-mode) . yas-minor-mode)
  :init
  ;; (setq yas-prompt-functions '(yas-ido-prompt))
  (defun lc/yas-try-expanding-auto-snippets ()
    (when (and (boundp 'yas-minor-mode) yas-minor-mode)
      (let ((yas-buffer-local-condition ''(require-snippet-condition . auto)))
        (yas-expand))))
  :config
  (yas-reload-all)
  (add-hook 'post-command-hook #'lc/yas-try-expanding-auto-snippets)
  )
#+end_src

