readme.org
** avy
:PROPERTIES:
:CUSTOM_ID: h:37FF0EE6-B8B7-4208-8F31-7361AB22DC52
:END:
#+begin_src emacs-lisp
(use-package avy
  :general
  (general-nmap
    "gs" 'avy-goto-char-2)
  ;; :bind (("C-:" . avy-goto-char)
  ;;        ("C-'" . avy-goto-char-2)
  ;;        ("C-;" . avy-goto-char-2)
  ;;        ("M-g f" . avy-goto-line)
  ;;        ("M-g w" . avy-goto-word-1)
  ;;        ("M-g e" . avy-goto-word-0))
  :hook (after-init . avy-setup-default)
  :init
  (setq avy-style 'pre)
  ;; :custom ( avy-all-windows nil
  ;;               avy-all-windows-alt t
  ;;               avy-background t
  ;;               avy-style 'pre)
  )
#+end_src

** COMMENT kubernetes
:PROPERTIES:
:CUSTOM_ID: h:3645D06E-69FC-4B56-AEAF-A5967E66FD85
:END:
#+begin_src emacs-lisp
(use-package kubernetes
  :hook
  (kubernetes-overview-mode . lc/load-kubernetes-evil)
  :general
  (lc/leader-keys
    "k k" 'kubernetes-overview)
  :init
  ;; refresh manually with gr
  (setq kubernetes-poll-frequency 3600)
  (setq kubernetes-redraw-frequency 3600)
  (defun lc/load-kubernetes-evil ()
    "Copied from kubernetes-evil.el"
    (evil-set-initial-state 'kubernetes-mode 'motion)
    (evil-set-initial-state 'kubernetes-display-thing-mode 'motion)
    (evil-set-initial-state 'kubernetes-log-line-mode 'motion)
    (evil-set-initial-state 'kubernetes-logs-mode 'motion)
    (evil-set-initial-state 'kubernetes-overview-mode 'motion)

    (evil-define-key 'motion kubernetes-mode-map
      (kbd "p")   #'magit-section-backward
      (kbd "n")   #'magit-section-forward
      (kbd "M-p") #'magit-section-backward-sibling
      (kbd "M-n") #'magit-section-forward-sibling
      (kbd "C-i") #'magit-section-toggle
      (kbd "^")   #'magit-section-up
      [tab]       #'magit-section-toggle
      [C-tab]     #'magit-section-cycle
      [M-tab]     #'magit-section-cycle-diffs
      [S-tab]     #'magit-section-cycle-global

      [remap evil-next-line] #'next-line
      [remap evil-previous-line] #'previous-line
      [remap evil-next-visual-line] #'next-line
      [remap evil-previous-visual-line] #'previous-line

      (kbd "q") #'quit-window
      (kbd "RET") #'kubernetes-navigate
      (kbd "M-w") #'kubernetes-copy-thing-at-point

      (kbd "?") #'kubernetes-overview-popup
      (kbd "c") #'kubernetes-config-popup
      (kbd "g r") #'kubernetes-refresh
      (kbd "h") #'describe-mode
      (kbd "d") #'kubernetes-describe-popup
      (kbd "D") #'kubernetes-mark-for-delete
      (kbd "e") #'kubernetes-exec-popup
      (kbd "u") #'kubernetes-unmark
      (kbd "U") #'kubernetes-unmark-all
      (kbd "x") #'kubernetes-execute-marks
      (kbd "l") #'kubernetes-logs-popup
      (kbd "L") #'kubernetes-labels-popup)

    (evil-define-key 'motion kubernetes-overview-mode-map
      (kbd "v") #'kubernetes-overview-set-sections)

    (evil-define-key 'motion kubernetes-logs-mode-map
      (kbd "n") #'kubernetes-logs-forward-line
      (kbd "p") #'kubernetes-logs-previous-line
      (kbd "RET") #'kubernetes-logs-inspect-line)

    (evil-define-key 'motion kubernetes-log-line-mode-map
      (kbd "n") #'kubernetes-logs-forward-line
      (kbd "p") #'kubernetes-logs-previous-line))
  )
#+end_src

** COMMENT loccurr
:PROPERTIES:
:CUSTOM_ID: h:3FC3E32D-BE2D-421C-B599-94E802009AB0
:END:
#+begin_src emacs-lisp
(use-package loccur
  :commands (loccur-isearch)
  )
#+end_src

* Programming languages
:PROPERTIES:
:CUSTOM_ID: h:844F8FAD-8F11-4727-BAC4-25B449C56B51
:header-args:    :emacs-lisp :tangle ./lisp/init-extra.el
:END:
** lsp mode and friends                                            :prog_lsp:
:PROPERTIES:
:CUSTOM_ID: h:6BC08822-D2B3-4BE9-9EBE-C42F89F0E688
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-lsp.el
:END:
*** lsp-mode                                                            
:PROPERTIES:
:CUSTOM_ID: h:28CB5546-FBE4-481D-B620-623006DC0FDA
:END:
#+BEGIN_SRC emacs-lisp
(use-package lsp-mode
  :commands
  (lsp lsp-deferred)
  :hook
  ((lsp-mode . (lambda () (setq-local evil-lookup-func #'lsp-describe-thing-at-point)))
   (lsp-mode . lsp-enable-which-key-integration))
  :general
  (lc/local-leader-keys
    :states 'normal
    :keymaps 'lsp-mode-map
    "i" '(:ignore t :which-key "import")
    "i o" '(lsp-organize-imports :wk "optimize")
    "l" '(:keymap lsp-command-map :wk "lsp")
    "a" '(lsp-execute-code-action :wk "code action")	
    "r" '(lsp-rename :wk "rename"))
  ;; (lsp-mode-map
  ;;  :states 'normal
  ;;  "gD" 'lsp-find-references)
  :init
  (setq lsp-restart 'ignore)
  (setq lsp-eldoc-enable-hover nil)
  (setq lsp-enable-file-watchers nil)
  (setq lsp-signature-auto-activate nil)
  (setq lsp-modeline-diagnostics-enable nil)
  (setq lsp-keep-workspace-alive nil)
  (setq lsp-auto-execute-action nil)
  (setq lsp-before-save-edits nil)
	(setq lsp-headerline-breadcrumb-enable nil)
  (setq lsp-diagnostics-provider :none)
  )
#+END_SRC

*** lsp-ui                                                               
:PROPERTIES:
:CUSTOM_ID: h:B69B077F-B96E-4A86-859D-A3D29547D39C
:END:
#+BEGIN_SRC emacs-lisp
(use-package lsp-ui
  :hook
  ((lsp-mode . lsp-ui-mode)
   ;; (lsp-mode . (lambda () (setq-local evil-goto-definition-functions '(lambda (&rest args) (lsp-ui-peek-find-definitions)))))
   )
  ;; :bind
  ;; (:map lsp-ui-mode-map
  ;;       ([remap lsp-find-references] . lsp-ui-peek-find-references))
  :general
  ;; (lc/local-leader-keys
  ;;   "h" 'lsp-ui-doc-show
  ;;   "H" 'lsp-ui-doc-hide)
  (lsp-ui-peek-mode-map
   :states 'normal
   "C-j" 'lsp-ui-peek--select-next
   "C-k" 'lsp-ui-peek--select-prev)
  (outline-mode-map
   :states 'normal
   "C-j" 'nil
   "C-k" 'nil)
  :init
  (setq lsp-ui-doc-show-with-cursor nil)
  (setq lsp-ui-doc-show-with-mouse nil)
  (setq lsp-ui-peek-always-show t)
  (setq lsp-ui-peek-fontify 'always)
  )
#+END_SRC

