readme.org
*** ess
:PROPERTIES:
:CUSTOM_ID: h:06BE4AA2-688D-4748-BF6D-9656EF6ED767
:END:
#+begin_src emacs-lisp
(use-package ess
  :general
  (lc/local-leader-keys
    :keymaps 'ess-r-mode-map
    :states 'normal
    "R" '(R :wk "R")
    "q" '(ess-quit :wk "quit")
    "RET" '(ess-eval-line-visibly-and-step :wk "line and step")
    ;; debug
    "d b" '(ess-bp-set :wk "breakpoint")
    "d n" '(ess-debug-command-next :wk "next")
    "d q" '(ess-debug-command-quit :wk "quit")
    "d c" '(ess-bp-next :wk "continue")
    "d f" '(ess-debug-flag-for-debugging :wk "flag function")
    "d F" '(ess-debug-unflag-for-debugging :wk "unflag function")
    "d p" '(ess-debug-goto-debug-point :wk "go to point")
    ;; "e l" '(ess-eval-line :wk "eval line")
    "e p" '(ess-eval-paragraph :wk "paragraph")
    "e f" '(ess-eval-function :wk "function")
    "h" '(:keymap ess-doc-map :which-key "help")
    ;; "h" '(ess-display-help-on-object :wk "help")
    )
  (lc/local-leader-keys
    :keymaps 'ess-r-mode-map
    :states 'visual
    "RET" '(ess-eval-region-or-line-visibly-and-step :wk "line and step"))
  :init
  (setq ess-eval-visibly 'nowait)
  (setq ess-R-font-lock-keywords '((ess-R-fl-keyword:keywords . t)
                                   (ess-R-fl-keyword:constants . t)
                                   (ess-R-fl-keyword:modifiers . t)
                                   (ess-R-fl-keyword:fun-defs . t)
                                   (ess-R-fl-keyword:assign-ops . t)
                                   (ess-R-fl-keyword:%op% . t)
                                   (ess-fl-keyword:fun-calls . t)
                                   (ess-fl-keyword:numbers . t)
                                   (ess-fl-keyword:operators . t)
                                   (ess-fl-keyword:delimiters . t)
                                   (ess-fl-keyword:= . t)
                                   (ess-R-fl-keyword:F&T . t)))
	;; (setq ess-first-continued-statement-offset 2
  ;;         ess-continued-statement-offset 0
  ;;         ess-expression-offset 2
  ;;         ess-nuke-trailing-whitespace-p t
  ;;         ess-default-style 'DEFAULT)
	;; (setq ess-r-flymake-linters "line_length_linter = 120")
  )
#+end_src

*** ESS data viewer
:PROPERTIES:
:CUSTOM_ID: h:9838BF54-50A8-4E07-8639-184253159FC3
:END:
#+begin_src emacs-lisp
(use-package ess-view-data
  :general
  (lc/local-leader-keys
    :keymaps 'ess-r-mode-map
    :states 'normal
    "hd" 'ess-R-dv-pprint
    "ht" 'ess-R-dv-ctable
    ))
#+end_src

*** enable lsp-mode
:PROPERTIES:
:CUSTOM_ID: h:4492B9C6-4E27-4A4D-B927-13D3DDD44706
:END:
#+begin_src emacs-lisp
(use-package lsp-mode
  :hook
  (ess-r-mode . lsp-deferred)
	)
#+end_src

** emacs-lisp                                                    :prog_elisp:
:PROPERTIES:
:CUSTOM_ID: h:6956B874-2F21-42A1-8343-C4BF7B1123C9
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-elisp.el
:END:
*** emacs-lisp-mode
:PROPERTIES:
:CUSTOM_ID: h:96EF892B-7F9F-4F69-B72C-C01F011A054D
:END:
#+begin_src emacs-lisp
(use-package emacs
  :straight (:type built-in)
	:general
	(general-nmap
		:keymaps 'emacs-lisp-mode-map
    :states 'normal
   "gr" nil) ;; interferes with eval-operator
	)
#+end_src

*** evil-lisp state
:PROPERTIES:
:CUSTOM_ID: h:C59E740E-F00B-4D2F-B5A3-36C3B99BCD5E
:END:
NOTE:
+ Wrap with =SPC l w=
+ Raise with =SPC l r=
+ Enter ~lisp-state~ with =SPC l .=
+ Navigate symbols with =j= and =k=
+ Navigate forms with =h= and =l=
+ Go to parent sexp with =U=

#+begin_src emacs-lisp
(use-package evil-lisp-state
  :after evil
  :demand
  :init
  (setq evil-lisp-state-enter-lisp-state-on-command nil)
  (setq evil-lisp-state-global t)
  ;; (setq evil-lisp-state-major-modes '(org-mode emacs-lisp-mode clojure-mode clojurescript-mode lisp-interaction-mode))
  :config
  (evil-lisp-state-leader "SPC l")
  )
#+end_src

*** eros: results in overlays
:PROPERTIES:
:CUSTOM_ID: h:309D0DC9-29FF-46E8-A98A-F2CD6CCEB12A
:END:
#+begin_src emacs-lisp
(use-package eros
  :hook ((emacs-lisp-mode org-mode lisp-interaction-mode) . eros-mode)
  :general
  (lc/local-leader-keys
    :keymaps '(org-mode-map emacs-lisp-mode-map lisp-interaction-mode-map)
    :states 'normal
    "e l" '(eros-eval-last-sexp :wk "last sexp")
    ;; "e d" '((lambda () (interactive) (eros-eval-defun t)) :wk "defun")
    "e b" '(eval-buffer :wk "buffer"))
  (lc/local-leader-keys
    :keymaps '(org-mode-map emacs-lisp-mode-map lisp-interaction-mode-map)
    :states 'visual
    ;; "e" '((lambda (start end)
    ;;         (interactive (list (region-beginning) (region-end)))
    ;;         (eval-region start end t))
    ;;       :wk "region")
    ;; "e" '((lambda (start end)
    ;;         (interactive (list (region-beginning) (region-end)))
    ;;         (eros--eval-overlay
    ;;          (eval-region start end)
    ;;          end))
    ;;       :wk "region")
		"e" '(eros-eval-region :wk "region")
    )
	:init
  (defun eros-eval-region (start end)
    (interactive "r")
    (eros--eval-overlay
     (string-trim
      (with-output-to-string
        (eval-region start end standard-output)))
     (max (point) (mark))))
  )
#+end_src

** Nix                                                                  :prog_nix:
:PROPERTIES:
:CUSTOM_ID: h:88E57F7B-DA1F-4BC1-BAD3-5BA459D054B7
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-nix.el
:END:
*** nix mode
:PROPERTIES:
:CUSTOM_ID: h:D9238686-7FDE-406A-BAE1-DF8293A02647
:END:
#+begin_src emacs-lisp
(use-package nix-mode
:mode "\\.nix\\'")
#+end_src

** Clojure                                                          :prog_clojure:
:PROPERTIES:
:CUSTOM_ID: h:2A226DAE-B566-464B-AF20-4BE86E554DC6
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-clojure.el
:END:
*** Clojure mode
:PROPERTIES:
:CUSTOM_ID: h:C757468F-281B-4A9D-84AF-26B9B656F01C
:END:
#+begin_src emacs-lisp
(use-package clojure-mode
  :mode "\\.clj$"
  :init
  (setq clojure-align-forms-automatically t))
#+end_src

*** clojure-lsp
:PROPERTIES:
:CUSTOM_ID: h:1613B1A4-02B4-4EB0-AC4B-53FA0BF3CF60
:END:

#+begin_src emacs-lisp
(use-package clojure-mode
  :hook
  ((clojure-mode clojurescript-mode)
   . (lambda ()
       (setq-local lsp-enable-indentation nil ; cider indentation
                   lsp-enable-completion-at-point nil ; cider completion
                   )
       (lsp-deferred)))
  )
#+end_src

