lisp/init-prog-clojure.el
;; [[file:../readme.org::#h:C757468F-281B-4A9D-84AF-26B9B656F01C][Clojure mode:1]]
(use-package clojure-mode
  :mode "\\.clj$"
  :init
  (setq clojure-align-forms-automatically t)
	)
;; Clojure mode:1 ends here

;; [[file:../readme.org::#h:1613B1A4-02B4-4EB0-AC4B-53FA0BF3CF60][clojure-lsp:1]]
(use-package clojure-mode
  :hook
  ((clojure-mode clojurescript-mode)
   . (lambda ()
       (setq-local lsp-enable-indentation nil ; cider indentation
                   lsp-enable-completion-at-point nil ; cider completion
                   )
       (lsp-deferred)))
  )
;; clojure-lsp:1 ends here

;; [[file:../readme.org::#h:3D8B9BAA-05E9-4F0B-8988-4B56882BB607][Cider:1]]
(use-package cider
