readme.org
*** Cider
:PROPERTIES:
:CUSTOM_ID: h:3D8B9BAA-05E9-4F0B-8988-4B56882BB607
:END:
#+begin_src emacs-lisp
(use-package cider
  :hook ((cider-repl-mode . evil-normalize-keymaps)
         (cider-mode . (lambda ()
                           (setq-local evil-lookup-func #'cider-doc)))
         (cider-mode . eldoc-mode))
  :general
  (lc/local-leader-keys
    :keymaps 'clojure-mode-map
    "c" '(cider-connect-clj :wk "connect")
    "C" '(cider-connect-cljs :wk "connect (cljs)")
    "j" '(cider-jack-in :wk "jack in")
    "J" '(cider-jack-in-cljs :wk "jack in (cljs)")
    "d d" 'cider-debug-defun-at-point 
    "e b" 'cider-eval-buffer
    "e l" 'cider-eval-last-sexp
    "e L" 'cider-pprint-eval-last-sexp-to-comment
    "e d" '(cider-eval-defun-at-point :wk "defun")
    "e D" 'cider-pprint-eval-defun-to-comment
		"h" 'cider-clojuredocs-web 
		"K" 'cider-doc
		"q" '(cider-quit :qk "quit")
		)
  (lc/local-leader-keys
    :keymaps 'clojure-mode-map
    :states 'visual
    "e" 'cider-eval-region)
  :init
  (setq nrepl-hide-special-buffers t)
  (setq nrepl-sync-request-timeout nil)
	(setq cider-repl-display-help-banner nil)
  )
#+end_src

*** COMMENT Eval sexp at point
:PROPERTIES:
:CUSTOM_ID: h:D23F2C41-0162-4E11-A052-17B37B48AF2D
:END:
#+begin_src emacs-lisp
(use-package cider
  :init
  (defun mpereira/cider-eval-sexp-at-point (&optional output-to-current-buffer)
    "Evaluate the expression around point.
If invoked with OUTPUT-TO-CURRENT-BUFFER, output the result to current buffer."
    (interactive "P")
    (save-excursion
      (goto-char (- (cadr (cider-sexp-at-point 'bounds))
                    1))
      (cider-eval-last-sexp output-to-current-buffer)))
  )
#+end_src

*** ob-clojure
:PROPERTIES:
:CUSTOM_ID: h:3B21567B-6B7B-4747-B44B-AA2480FA49E5
:END:
#+begin_src emacs-lisp
(use-package org
:config
(require 'ob-clojure)
(setq org-babel-clojure-backend 'cider))
#+end_src

*** aggressive-indent
:PROPERTIES:
:CUSTOM_ID: h:804F32D8-081E-427C-8949-90D3ECF5879F
:END:
#+begin_src emacs-lisp
  ;; keep the file indented
  (use-package aggressive-indent
    :hook ((clojure-mode . aggressive-indent-mode)
           (emacs-lisp-mode . aggressive-indent-mode)))
#+end_src

** markdown                                                   :prog_markdown:
:PROPERTIES:
:CUSTOM_ID: h:C643DC36-8F5E-40E4-B8BB-126F341491FD
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-markdown.el
:END:
#+begin_src emacs-lisp
(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
#+end_src

** yaml mode                                                  :prog_markdown:
:PROPERTIES:
:CUSTOM_ID: h:351ADC7D-38F2-47FF-9D9B-1C3F2F7B61D3
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-markdown.el
:END:
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode ((rx ".yml" eos) . yaml-mode))
#+end_src

** toml mode                                                  :prog_markdown:
:PROPERTIES:
:CUSTOM_ID: h:4474E2AE-F934-48CD-ACB8-5729B7C26F0A
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-markdown.el
:END:
#+begin_src emacs-lisp
(use-package toml-mode
	:mode "\\.toml\\'")
#+end_src

* Gimmicks
:PROPERTIES:
:CUSTOM_ID: h:7D94EA42-5F85-4E18-9029-19BAD69FBF85
:END:
** web browser                                                    :extra_web:
:PROPERTIES:
:CUSTOM_ID: h:6B214C3A-22E3-47D0-9DD7-F379E07CF960
:header-args:    :emacs-lisp :tangle ./lisp/init-extra-web.el
:END:
Use =SPC x x= to search the web! You can also visit a URL in the buffer.
With the web browser open, scroll with =j= / =k= .
To visit a link, =SPC x l= 
#+begin_src emacs-lisp
(use-package xwwp
  :straight (xwwp :type git :host github :repo "canatella/xwwp")
  :commands (xwwp)
  :general
  (lc/leader-keys
    "x x" '((lambda () (interactive)
              (let ((current-prefix-arg 4)) ;; emulate C-u universal arg
                (call-interactively 'xwwp)))
            :wk "search or visit")
    "x l" '(xwwp-follow-link :wk "link")
    "x b" '(xwidget-webkit-back :wk "back"))
  ;; :custom
  ;; (setq xwwp-follow-link-completion-system 'ivy)
  ;; :bind (:map xwidget-webkit-mode-map
  ;;             ("v" . xwwp-follow-link))
  )
#+end_src

** elfeed                                                         :extra_rss:
:PROPERTIES:
:CUSTOM_ID: h:B0653EBC-9E48-4E3D-86A3-34E7450B4F03
:header-args:    :emacs-lisp :tangle ./lisp/init-extra-rss.el
:END:
NOTE:
- Search with =s=
- Open in browser with =S-RET=
- Open in ~xwwp~ with =x=

#+begin_src emacs-lisp
(use-package elfeed
  :straight (elfeed :type git :host github :repo "skeeto/elfeed")
  :hook (elfeed-search-mode . elfeed-update)
  :general
  (lc/leader-keys
    "s r" '(elfeed :wk "elfeed"))
  (general-nmap
		:keymaps 'elfeed-search-mode-map
   "x" 'lc/elfeed-xwwp-open)
  :init
  (defun lc/elfeed-xwwp-open (&optional use-generic-p)
    "open with eww"
    (interactive "P")
    (let ((entries (elfeed-search-selected)))
      (cl-loop for entry in entries
               do (elfeed-untag entry 'unread)
               when (elfeed-entry-link entry)
               do (xwwp it))
      (mapc #'elfeed-search-update-entry entries)
      (unless (use-region-p) (forward-line))))
  :config
  (setq elfeed-feeds'(("https://www.reddit.com/r/emacs.rss?sort=new" reddit emacs)
                      ("http://emacsredux.com/atom.xml" emacs)
                      ("http://irreal.org/blog/?tag=emacs&amp;feed=rss2" emacs)
                      ("https://www.reddit.com/search.rss?q=url%3A%28youtu.be+OR+youtube.com%29&sort=top&t=week&include_over_18=1&type=link"
                      reddit youtube popular))))
#+end_src
 
** COMMENT reddit
:PROPERTIES:
:CUSTOM_ID: h:B616A404-0B56-4C56-9A8C-343E212F536A
:END:
#+begin_src emacs-lisp
(use-package md4rd
  :general
  (lc/leader-keys
    "s r" '(md4rd :wk "reddit"))
  :init
  (setq md4rd-subs-active '(emacs apple clojure MachineLearning))
  :config
  (add-hook 'md4rd-mode-hook 'md4rd-indent-all-the-lines)
  (require 'cl)
  )
#+end_src

** COMMENT dash docsets
:PROPERTIES:
:CUSTOM_ID: h:F60C9AFB-AF3C-434D-B2C9-14741185D0DB
:END:
- ~dash-docs-install-docset~
- ~dash-docs-search~

#+begin_src emacs-lisp
(use-package dash-docs
  :init
  ;; (setq dash-docs-browser-func 'eww)
  (setq dash-docs-common-docsets '("Pandas"))
  )
#+end_src

#+begin_src emacs-lisp
(use-package dash-at-point
	:general
  (lc/leader-keys
    "s d" '(dash-at-point :which-key "search dash"))
	)
#+end_src

* Provide modules
:PROPERTIES:
:CUSTOM_ID: h:754DFB20-B2AB-4750-9BDA-D24E8014C504
:END:
** init-core
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./lisp/init-core.el
:END:
#+begin_src emacs-lisp
(provide 'init-core)
;;; init-core.el ends here
#+end_src

** init-ui-extras
:PROPERTIES:
:CUSTOM_ID: h:E80DEB4B-6AC9-415D-AF36-0044479D1B5A
:header-args:    :emacs-lisp :tangle ./lisp/init-ui-extra.el
:END:
#+begin_src emacs-lisp
(provide 'init-ui-extra)
;;; init-ui-extra.el ends here
#+end_src

** init-org-export
:PROPERTIES:
:CUSTOM_ID: h:A646A19B-12BC-4B95-A592-BCB640E10659
:header-args:    :emacs-lisp :tangle ./lisp/init-org-export.el
:END:
#+begin_src emacs-lisp
(provide 'init-org-export)
;;; init-org-export.el ends here
#+end_src

** init-prog-tree-sitter
:PROPERTIES:
:CUSTOM_ID: h:A646A19B-12BC-4B95-A592-BCB640E10659
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-tree-sitter.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-tree-sitter)
;;; init-prog-tree-sitter.el ends here
#+end_src

** init-prog-nix
:PROPERTIES:
:CUSTOM_ID: h:E80DEB4B-6AC9-415D-AF36-0044479D1B5A
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-nix.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-nix)
;;; init-prog-nix.el ends here
#+end_src

** init-prog-lsp
:PROPERTIES:
:CUSTOM_ID: h:E80DEB4B-6AC9-415D-AF36-0044479D1B5A
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-lsp.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-lsp)
;;; init-prog-lsp.el ends here
#+end_src

** init-prog-python
:PROPERTIES:
:CUSTOM_ID: h:E80DEB4B-6AC9-415D-AF36-0044479D1B5A
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-python.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-python)
;;; init-prog-python.el ends here
#+end_src

** init-prog-jupyter
:PROPERTIES:
:CUSTOM_ID: h:FD3CCF1B-8F23-4863-8592-0AF46542AB21
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-jupyter.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-jupyter)
;;; init-prog-jupyter.el ends here
#+end_src

