lisp/init-core.el

(provide 'init-core)
;;; init-core.el ends here
