lisp/init-ui-extra.el

;; [[file:../readme.org::#h:E80DEB4B-6AC9-415D-AF36-0044479D1B5A][init-ui-extras:1]]
(provide 'init-ui-extra)
;;; init-ui-extra.el ends here
;; init-ui-extras:1 ends here
