readme.org
** init-org-roam
:PROPERTIES:
:CUSTOM_ID: h:8C169B84-C560-42FB-8A12-F052E4685ECB
:header-args:    :emacs-lisp :tangle ./lisp/init-org-roam.el
:END:
#+begin_src emacs-lisp
(provide 'init-org-roam)
;;; init-org-roam.el ends here
#+end_src

** init-prog-elisp
:PROPERTIES:
:CUSTOM_ID: h:6F1A571B-D934-4CF8-BE66-3363F695B7B5
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-elisp.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-elisp)
;;; init-org-prog-elisp.el ends here
#+end_src

** init-prog-r
:PROPERTIES:
:CUSTOM_ID: h:A480FCCD-E2E4-4BBA-ACA1-DEF5EFDC1D03
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-r.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-r)
;;; init-org-prog-r.el ends here
#+end_src

** init-prog-clojure
:PROPERTIES:
:CUSTOM_ID: h:39D468C7-8D6B-4F16-A3FE-8675917B3DBD
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-clojure.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-clojure)
;;; init-org-prog-clojure.el ends here
#+end_src

** init-prog-vterm
:PROPERTIES:
:CUSTOM_ID: h:EE92BA80-1F88-4D69-A45C-69268595FA71
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-vterm.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-vterm)
;;; init-prog-vterm.el ends here
#+end_src

** init-prog-markdown
:PROPERTIES:
:CUSTOM_ID: h:B315364E-ECF0-4ABC-9ACB-7546F6BB734C
:header-args:    :emacs-lisp :tangle ./lisp/init-prog-markdown.el
:END:
#+begin_src emacs-lisp
(provide 'init-prog-markdown)
;;; init-prog-markdown.el ends here
#+end_src

** init-extra-focus
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./lisp/init-extra-focus.el
:CUSTOM_ID: h:E8D67694-4B23-47E2-800B-10136B4D8F2A
:END:
#+begin_src emacs-lisp
(provide 'init-extra-focus)
;;; init-org-extra-focus.el ends here
#+end_src

** init-extra-web
:PROPERTIES:
:CUSTOM_ID: h:11871421-6FA2-4450-AA35-B779A525FE69
:header-args:    :emacs-lisp :tangle ./lisp/init-extra-web.el
:END:
#+begin_src emacs-lisp
(provide 'init-extra-web)
;;; init-org-extra-web.el ends here
#+end_src

** init-extra-rss
:PROPERTIES:
:CUSTOM_ID: h:A8F1EDE6-D506-49E6-A459-3AF50486BC89
:header-args:    :emacs-lisp :tangle ./lisp/init-extra-rss.el
:END:
#+begin_src emacs-lisp
(provide 'init-extra-rss)
;;; init-org-extra-rss.el ends here
#+end_src

** init-extras
:PROPERTIES:
:CUSTOM_ID: h:E80DEB4B-6AC9-415D-AF36-0044479D1B5A
:header-args:    :emacs-lisp :tangle ./lisp/init-extra.el
:END:
#+begin_src emacs-lisp
(provide 'init-extra)
;;; init-extra.el ends here
#+end_src

* COMMENT to add / to fix
:PROPERTIES:
:CUSTOM_ID: h:742F97D8-9FC2-4ED4-9985-A23192D75550
:END:
** To add
:PROPERTIES:
:CUSTOM_ID: h:167C14F0-55E7-4524-98BC-1C605BA44337
:END:
*** Make different font configurations (toggle big font)
:PROPERTIES:
:CUSTOM_ID: h:48656013-A692-467F-93DB-9E09967DE531
:END:
*** Make different window configurations for dap-mode
:PROPERTIES:
:CUSTOM_ID: h:42BF8EDB-1ABA-4DA9-A362-4D595791FA69
:END:
+ One with just the code and the REPL
+ One with everything
*** Improve LaTeX setup
:PROPERTIES:
:CUSTOM_ID: h:10F1C33B-B19C-4769-895D-2F81411D18EA
:END:
https://gist.github.com/bigodel/56a4627afdfe9ad28f6dcc68b89a97f8
*** eval region in org
:PROPERTIES:
:CUSTOM_ID: h:A26EC598-6EA3-4CEB-AB36-8C417E385F38
:END:
#+begin_src emacs-lisp
(defun my/ess-eval ()
  (interactive)
  (let* ((buffst))
    (if (string-equal ess-language "SAS")
        (progn
          (if (and transient-mark-mode mark-active)
              (setq buffst (buffer-substring-no-properties (region-beginning) (region-end)))
            (setq buffst (buffer-substring-no-properties (beginning-of-line) (end-of-line))))
          (save-window-excursion
            (switch-to-buffer "*iESS[SAS]*")
            (goto-char (point-max))
            (comint-send-input)
            (goto-char (point-max))
            (insert buffst)
            (comint-send-input)
            ))
      (progn
        (if (and transient-mark-mode mark-active)
            (call-interactively 'ess-eval-region)
          (call-interactively 'ess-eval-line-and-step))
				))))
#+end_src

*** View dataframe in SES mode
:PROPERTIES:
:CUSTOM_ID: h:5F6DBFD0-7C74-4102-BBCD-3F6CB2913882
:END:
#+begin_src emacs-lisp
(defun lc/jupyter-df-to-tsv (dataframe)
  (thread-last
    (jupyter-eval (concat "df" ".to_csv(sep='\t')"))
    (string-replace "'" "")
    ;; (subst-char-in-string ?\\ ?\\ )
    ;; (string-replace "\\t" "t")
    ))

;; (defun lc/dap-eval (expression)
;;   (dap-eval expression)
;;   (sleep-for 2)
;;   )

(defun lc/dap-eval (expression)
  "Eval and print EXPRESSION."
  (interactive "sEval: ")
  (let* ((debug-session (dap--cur-active-session-or-die))
         (active-frame-id (-some->> debug-session
                            dap--debug-session-active-frame
                            (gethash "id")))
         (result (dap--send-message
                  (dap--make-request "evaluate"
                                     (list :expression expression
                                           :frameId active-frame-id
                                           :context "hover"
                                           ))
                  (lambda (res) (setf result (or res :finished)))
                  debug-session)))
    (while (not result)
      (accept-process-output nil 0.001))
    ;; (thread-first
    ;;   (gethash "result" (gethash "body" result))
    ;;   (substring 4 -1)
    ;;   )
    ))

(defun lc/dap-df-to-tsv (dataframe)
  (lc/dap-eval (concat dataframe ".to_csv(sep='\t')")))

(defun lc/pd-to-ses (dataframe)
  (interactive (list (read-from-minibuffer "DataFrame: " (evil-find-symbol nil))))
  ;; (interactive "sVariable: ")
  (let ((buffer (get-buffer-create
                 (generate-new-buffer-name "*ein:ses pandas*")))
        (tsv (lc/dap-df-to-tsv dataframe)))
    ;; Open `ses-mode' buffer
    (with-current-buffer buffer
      (ses-mode)
      (ses-yank-tsf tsv nil)
      (ses-command-hook)
      ;; (cl-flet ((y-or-n-p
      ;;            (prompt)
      ;;            (if (string-prefix-p "Yank will insert " prompt) t (error "Unexpected prompt: %s" prompt)))))
      )
    (pop-to-buffer buffer)))

#+end_src

*** ~demo-it~
:PROPERTIES:
:CUSTOM_ID: h:4CBD79C8-23E1-4415-AE16-7004B020DCAE
:END:
- https://github.com/howardabrams/demo-it
- https://github.com/howardabrams/literate-devops-demo/blob/master/literate-devops-demo.el
- https://github.com/howardabrams/magit-demo/blob/master/magit-demo.el
*** More transient commands!
:PROPERTIES:
:CUSTOM_ID: h:CFC79023-39C4-46DE-8B94-49920C2E9444
:END:
#+begin_src emacs-lisp
(transient-define-prefix jh/terraform-transient-command ()
  "Run a terrafrom command."
  ["Get"
   ("g" "Get" jh/terraform-transient-get)]
  ["Run"
   ("a" "Apply" jh/terraform-transient-apply)
   ("p" "Plan" jh/terraform-plan)
   ("i" "Init" jh/terraform-init)])

(transient-define-prefix jh/terraform-transient-get ()
  ["Arguments"
   ("-u" "Update modules" "-update")]
  ["Actions"
   ("g" "Get" jh/terraform-get)])

(defun jh/terraform-get ()
  "Get any non-retrieved modules for the current terraform configuration."
  (interactive)
  (jh/terraform-run-async-command "get"))

(defun jh/terraform-run-async-command (action &rest args)
  "Run the terraform ACTION with optional ARGS asynchronously."
  (let ((command (string-join (cons action (transient-get-value)) " ")))
    (async-shell-command (format "terraform %s" command))))
#+end_src

*** docstrings
:PROPERTIES:
:CUSTOM_ID: h:5ED70817-7A77-4C7D-91E5-4CECC5E00990
:END:
#+begin_src emacs-lisp
(use-package docstr
 :straight (:host github :repo "jcs-elpa/docstr")
 :hook (after-init . global-docstr-mode)
 :config
 (cl-pushnew '(rustic-mode . docstr-writers-rust) docstr-writers-alist :test #'equal)
 (cl-pushnew '("/" . docstr-trigger-rust) docstr-trigger-alist :test #'equal))
#+end_src

*** Switch to ~project.el~
:PROPERTIES:
:CUSTOM_ID: h:779BF318-A030-42EC-A00A-BAEE5CDB5A95
:END:
- Start here: https://protesilaos.com/dotemacs/#h:7862f39e-aed0-4d02-9f1e-60c4601a9734
- Then here: https://github.com/CIAvash/persp-mode-project-bridge
** To fix
:PROPERTIES:
:CUSTOM_ID: h:92086A48-355B-426E-AB82-DB73FAA11A1C
:END:
*** ~helpful-variable~ sometimes throws syntax error
:PROPERTIES:
:CUSTOM_ID: h:9ABC9A4D-D71E-49E7-9C13-34DF1FFB2836
:END:
*** Can't export both light and dark themes, one of the two has wrong rainbow delimiters 
:PROPERTIES:
:CUSTOM_ID: h:6E70D3BF-8DDD-429F-92B8-BCBFCB42F94C
:END:
*** Can't export twice in a row
:PROPERTIES:
:CUSTOM_ID: h:5F766A45-274C-464F-AF6E-C7BB4BB17BC8
:END:
*** Setting of the theme is somehow wrong, dark is always set
:PROPERTIES:
:CUSTOM_ID: h:E9A59F97-B380-43D7-97EB-DAE30A17328F
:END:
* COMMENT Local variables
:PROPERTIES:
:CUSTOM_ID: h:8CE072CD-CA85-4E53-B672-E0AC74E4E4EC
:END:
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(progn (lc/org-add-ids-to-headlines-in-file) (lc/tangle-config))) nil t)
# End:
